[{"id":"EPIC-1","title":"Secure Multi-Factor Authentication and Access Management","summary":"Develop a secure login framework using multi-factor authentication for customer access.","description":"This epic focuses on building a secure access framework to protect customer accounts and sensitive information. It introduces multi-factor authentication (MFA) mechanisms such as OTPs, biometric or authenticator app verification, and encrypted session management. The system will ensure adherence to banking security standards, guard against unauthorized access, and maintain session integrity through token-based authentication. This implementation will guarantee a safe and compliant customer login experience across devices.","dependencies":[]},{"id":"EPIC-2","title":"Responsive and Accessible User Interface","summary":"Design a consistent, responsive UI with accessibility compliance for web and mobile platforms.","description":"This epic involves creating a modern, intuitive portal interface optimized for various screen sizes and devices, including desktops, tablets, and mobile phones. The goal is to ensure uniform usability and aesthetics by applying responsive design principles and accessibility guidelines (WCAG). It will feature an adaptive layout, touch-friendly controls, and keyboard accessibility, ensuring the portal is inclusive and easy to navigate for every user.","dependencies":[]},{"id":"EPIC-3","title":"Personalized Dashboard and Service Discovery","summary":"Implement a personalized dashboard displaying relevant accounts, offers, and banking services.","description":"This epic delivers a customer-specific dashboard driven by profile data and eligibility. The dashboard will provide real-time access to key information such as active accounts, balances, service requests, and tailored product recommendations. Contextual call-to-action panels will guide users to apply for new products or manage existing services quickly. This personalized experience will enhance customer satisfaction and promote data-driven service recommendations.","dependencies":["EPIC-1","EPIC-2"]},{"id":"EPIC-4","title":"Digital Account Opening and Service Request Workflows","summary":"Enable customers to initiate and manage service or account requests through self-service workflows.","description":"This epic introduces guided digital workflows for opening new bank accounts and modifying services. It will integrate auto-filling for known customer data, real-time form validation, and document upload options to minimize friction. Back-end orchestration will handle multi-step approvals while maintaining compliance with KYC and AML regulations. The design goal is to minimize user actions while improving efficiency through automation and workflow transparency.","dependencies":["EPIC-3"]},{"id":"EPIC-5","title":"Save and Resume Incomplete Applications","summary":"Allow users to pause incomplete applications and resume them at a later time.","description":"This epic focuses on providing customers the flexibility to save incomplete account openings or service requests and return later to finish them. It includes automated data persistence, encrypted draft storage, and auto-save capabilities to protect against data loss. A clear status indicator will help users identify incomplete steps. This feature enhances convenience, particularly for users handling complex or time-consuming application forms.","dependencies":["EPIC-4"]},{"id":"EPIC-6","title":"Secure Document Upload and Management System","summary":"Enable secure upload, validation, and management of documents within the portal.","description":"This epic introduces a document management system where customers can upload KYC and supporting documents securely as part of workflows. It incorporates file type and size validation, encryption during transfer and storage, and automated mapping of documents to the correct user requests. This system enables smooth back-office validation while maintaining regulatory compliance and strong data privacy protection for all uploaded files.","dependencies":["EPIC-4"]},{"id":"EPIC-7","title":"Real-Time Request Tracking and Notifications","summary":"Provide real-time progress tracking and automated notifications for service requests.","description":"This epic develops a mechanism for real-time tracking of submitted service requests and account openings. Customers will view current statuses such as ‘Submitted’, ‘Under Review’, ‘Approved’, or ‘Completed’. The notification engine will issue email or SMS alerts on key updates or required actions. This transparency ensures that customers stay informed throughout each process, reducing branch or call center dependency.","dependencies":["EPIC-4"]},{"id":"EPIC-8","title":"Comprehensive Interaction History and Audit Logs","summary":"Maintain an auditable history of all customer interactions within the portal.","description":"This epic focuses on logging and displaying detailed records of user activities such as service requests, document uploads, and transaction-related actions. Customers will have access to a summarized interaction history, while the system generates audit trails for internal compliance and monitoring. Immutable log storage will ensure records cannot be tampered with, supporting transparency, traceability, and regulatory compliance goals.","dependencies":["EPIC-7"]},{"id":"EPIC-9","title":"Core Banking and Middleware Integration Layer","summary":"Integrate the self-service portal with the core banking and middleware systems for data synchronization.","description":"This epic establishes secure APIs and middleware integration to synchronize customer data, transaction information, and service requests with the bank’s core systems in real time. It ensures data remains consistent across all platforms, with proper queuing and retry mechanisms for reliability. The integration will adhere to security and governance standards, using encrypted channels and detailed transaction logging for traceability.","dependencies":["EPIC-4","EPIC-6","EPIC-7"]},{"id":"EPIC-10","title":"Independent Database and Performance Optimization","summary":"Deploy a dedicated, high-performance database architecture to support portal scalability.","description":"This epic involves designing and deploying an independent database schema optimized for portal operations separate from the core banking systems. It includes indexing strategies, caching mechanisms, and performance monitoring to ensure fast load times and real-time response under heavy usage. Continuous tuning and replication strategies will ensure fault tolerance, disaster recovery, and overall portal stability.","dependencies":["EPIC-9"]},{"id":"EPIC-11","title":"Role-Based Access Control and Authorization Management","summary":"Implement a customizable role-based access control model to manage user permissions.","description":"This epic defines and enforces role-based access control (RBAC) policies to ensure each user type—customer, administrator, and operator—has access only to the features appropriate for their role. It governs visibility, editing rights, and transaction capabilities across modules while supporting dynamic access configuration. The framework ensures privacy, minimizes security risks, and complies with internal data governance policies.","dependencies":["EPIC-1","EPIC-9"]}]