[{"id":"EPIC-1","title":"Secure Multi-Factor Authentication and User Login","summary":"Implement a secure login system with multi-factor authentication for customers.","description":"Develop a secure authentication system that enables customers to log in using traditional credentials along with an added layer of protection through multi-factor authentication (MFA). Ensure all authentication mechanisms comply with banking security regulations and data privacy requirements to safeguard user credentials and sessions.","dependencies":[],"userStories":[{"id":"US-1.1","title":"Login with Username and Password","description":"As a customer, I want to log in with my username and password so that I can securely access my banking portal."},{"id":"US-1.2","title":"Enable Multi-Factor Authentication","description":"As a customer, I want to verify my identity using a second factor such as OTP or biometric verification to secure my account access."},{"id":"US-1.3","title":"Automatic Session Timeout","description":"As a customer, I want the system to log me out after a period of inactivity to protect my financial information from unauthorized access."}]},{"id":"EPIC-2","title":"Responsive and Accessible User Interface","summary":"Deliver a modern, responsive, and accessible interface across all device types.","description":"Design and build a modern, user-friendly interface that adapts to desktop, tablet, and mobile devices while conforming to accessibility standards. The interface should maintain consistent design, navigation, and function, ensuring a seamless experience for customers accessing the portal on any platform.","dependencies":[],"userStories":[{"id":"US-2.1","title":"Responsive UI Design","description":"As a customer, I want the portal to automatically adjust its layout to my device’s screen size so I can easily access features from any device."},{"id":"US-2.2","title":"Accessibility Features Support","description":"As a differently-abled customer, I want the portal interface to follow accessibility standards so that I can efficiently use all functionalities."}]},{"id":"EPIC-3","title":"Personalized Dashboard and Product Display","summary":"Create a personalized dashboard that displays user-specific financial information and offers.","description":"Develop a dynamic, data-driven dashboard that presents personalized content, including account overviews, recent transactions, and recommended banking products. Use profile-based eligibility criteria to show customized insights and offers to enhance user engagement and satisfaction.","dependencies":["EPIC-1","EPIC-2"],"userStories":[{"id":"US-3.1","title":"Display Account Overview","description":"As a customer, I want to view balances, accounts, and transactions in one unified dashboard so that I can conveniently monitor my finances."},{"id":"US-3.2","title":"Show Personalized Product Recommendations","description":"As a customer, I want the system to display banking products based on my eligibility and preferences so that I can access relevant offers."}]},{"id":"EPIC-4","title":"Digital Account Opening and Service Request Workflows","summary":"Allow customers to initiate account opening and modify services via digital workflows.","description":"Implement streamlined workflows to allow users to open new accounts or request service updates digitally. Ensure forms are interactive, data validation is applied at each step, and user inputs are auto-filled where possible to minimize manual effort. The process should comply with regulatory and KYC standards.","dependencies":["EPIC-3"],"userStories":[{"id":"US-4.1","title":"Apply for New Account Online","description":"As a customer, I want to open a new account online so that I can complete banking procedures digitally without visiting a branch."},{"id":"US-4.2","title":"Submit Service Modification Request","description":"As a customer, I want to modify my existing services, such as updating personal details or limits, through a digital workflow."}]},{"id":"EPIC-5","title":"Secure Document Upload and Management","summary":"Allow users to upload and manage their documents securely within the portal.","description":"Develop functionality to enable users to upload, view, and manage required documents for banking applications. Incorporate secure file transfer protocols, encryption of stored files, and compliance with document retention and privacy policies.","dependencies":["EPIC-4"],"userStories":[{"id":"US-5.1","title":"Upload Documents Securely","description":"As a customer, I want to upload required documents securely so that I can complete my application and service requests."},{"id":"US-5.2","title":"View Uploaded Documents","description":"As a customer, I want to view and confirm uploaded documents so that I can verify that correct files have been submitted."}]},{"id":"EPIC-6","title":"Save and Resume Application Processes","summary":"Allow customers to save progress on applications and return later to complete them.","description":"Develop a feature that enables users to save partially completed workflows, requests, or forms and resume them later. The saved data must be encrypted, automatically backed up, and re-validated upon return to ensure accuracy and integrity.","dependencies":["EPIC-4"],"userStories":[{"id":"US-6.1","title":"Save Incomplete Applications","description":"As a customer, I want to save my unfinished application so that I can continue later without losing entered data."},{"id":"US-6.2","title":"Resume Saved Applications","description":"As a customer, I want to easily resume my saved applications so that I can complete the process at a convenient time."}]},{"id":"EPIC-7","title":"Real-Time Application Tracking and Notifications","summary":"Provide real-time status tracking and notifications for all customer requests.","description":"Develop real-time tracking mechanisms for submitted requests, with status indicators visible through both the portal and email notifications. The system should automatically send updates at key stages, ensuring transparency and improved communication with customers.","dependencies":["EPIC-4"],"userStories":[{"id":"US-7.1","title":"Track Request Status","description":"As a customer, I want to monitor the status of my applications and requests in real time so that I know when actions are completed."},{"id":"US-7.2","title":"Receive Email Notifications","description":"As a customer, I want to receive email notifications when important status changes occur in my submitted requests."}]},{"id":"EPIC-8","title":"Activity History and Audit Logging","summary":"Maintain a complete record of customer and system interactions for transparency and compliance.","description":"Implement detailed logging and tracking of all customer interactions within the portal, including login attempts, submissions, modifications, and approvals. Allow customers to view their activity history while ensuring compliance through tamper-proof and encrypted logs for audit purposes.","dependencies":["EPIC-4"],"userStories":[{"id":"US-8.1","title":"View Interaction History","description":"As a customer, I want to view a record of my past requests and interactions so that I can keep track of all my banking activities."},{"id":"US-8.2","title":"Maintain Audit Logs","description":"As an administrator, I want complete system logs to be stored securely to support compliance and investigation requirements."}]},{"id":"EPIC-9","title":"Integration with Core Banking Systems","summary":"Seamlessly integrate the self-service portal with existing core banking systems.","description":"Develop real-time, secure integrations between the portal and the bank’s core systems using APIs or middleware layers. This ensures synchronized data for account details, transactions, and product availability, while maintaining system reliability and scalability.","dependencies":["EPIC-4","EPIC-7"],"userStories":[{"id":"US-9.1","title":"Real-Time Data Synchronization","description":"As a customer, I want my portal to display real-time information fetched from the bank’s core systems so that I always have up-to-date data."},{"id":"US-9.2","title":"Secure System Integration","description":"As a system architect, I want to design secured API-based integration so that data between the portal and core banking system remains protected."}]},{"id":"EPIC-10","title":"Independent Portal Database and Performance Optimization","summary":"Establish a separate, optimized database for portal operations.","description":"Create and configure a dedicated portal database that efficiently manages customer interactions and cached data independently of the core banking system. This database should ensure high-speed performance, backups, encryption, and disaster recovery mechanisms.","dependencies":["EPIC-9"],"userStories":[{"id":"US-10.1","title":"Dedicated Portal Database Establishment","description":"As a database engineer, I want to set up an independent database to ensure that the portal operates efficiently without impacting core banking systems."}]},{"id":"EPIC-11","title":"Role-Based Access Control (RBAC)","summary":"Implement RBAC to manage user permissions and control feature access.","description":"Develop a role-based access control (RBAC) mechanism ensuring that users only have access to data and functions relevant to their roles and authorization levels. This includes defining roles, permissions, and secure enforcement policies integrated with the authentication layer.","dependencies":["EPIC-1","EPIC-9"],"userStories":[{"id":"US-11.1","title":"Define User Roles and Permissions","description":"As an administrator, I want to set different roles and permissions for users so that access to sensitive data is restricted."},{"id":"US-11.2","title":"Enforce Role-Based Access","description":"As a customer, I want to only see and access options relevant to my profile so that I am not exposed to unauthorized information."}]}]