[{"id":"EPIC-1","title":"User Authentication and Multi-Factor Login","summary":"Implement secure multi-factor authentication for portal access.","description":"This epic covers the design and implementation of a secure authentication system allowing customers to log in using multi-factor authentication (MFA). It includes user registration, password management, and integration with the bank’s identity management service to ensure security and compliance. The login flow must be simple, consistent, and compatible with all supported devices, ensuring that customers can safely access their accounts anytime.","dependencies":[]},{"id":"EPIC-2","title":"Personalized Dashboard and Profile-Based Services","summary":"Develop a personalized dashboard displaying relevant banking products and services.","description":"This epic focuses on creating a dynamic, user-friendly dashboard that adapts to each customer's profile. The dashboard will display active accounts, personalized offers, and access to available banking services based on eligibility. It should incorporate a responsive design ensuring consistent user experience across desktop, tablet, and mobile devices. Data will be fetched securely from backend systems in real-time.","dependencies":["EPIC-1"]},{"id":"EPIC-3","title":"Responsive and Consistent User Interface","summary":"Build a responsive portal accessible on desktop, tablet, and mobile devices.","description":"This epic ensures the banking portal is fully responsive and maintains a consistent look and feel across all devices. It includes the design of reusable UI components, accessibility compliance, and front-end optimization to deliver a seamless and efficient experience regardless of screen size or operating system.","dependencies":[]},{"id":"EPIC-4","title":"Account Opening and Service Modification Workflows","summary":"Implement workflows for account opening requests and service changes.","description":"This epic defines and implements self-service workflows enabling customers to initiate new account openings, modify existing services, and request enhancements. The workflows should require minimal user input and clicks while automating backend interactions. Customers must be able to save incomplete applications and resume them later, upload required documentation, and receive confirmation of successful submissions.","dependencies":["EPIC-2"]},{"id":"EPIC-5","title":"Real-Time Status Tracking and Notifications","summary":"Provide real-time updates and email notifications on request statuses.","description":"This epic focuses on creating a notification subsystem that tracks the progress of user-initiated requests, such as account openings or service modifications. The portal should display real-time updates within the user dashboard and send email notifications for any status change, approval, or required action. Notifications should be configurable and compliant with communication policies.","dependencies":["EPIC-4"]},{"id":"EPIC-6","title":"Interaction History and Activity Log","summary":"Maintain a comprehensive log of all user interactions and requests.","description":"This epic ensures the system captures and retains complete interaction history for every user, including completed transactions, service requests, and document uploads. The history should be easily accessible through the portal, allowing users to review their previous actions. Proper audit controls and security measures must be implemented to protect customer privacy and comply with data retention policies.","dependencies":["EPIC-4"]},{"id":"EPIC-7","title":"Core Banking Integration and Data Synchronization","summary":"Integrate the portal with the bank’s existing core systems.","description":"This epic involves integration with the bank’s core banking systems using secure APIs or middleware. It ensures synchronization of customer accounts, balances, and transaction data between the portal and core systems. The architecture must maintain high performance and reliability while isolating the self-service portal database to handle portal-specific operations effectively.","dependencies":["EPIC-4","EPIC-5"]},{"id":"EPIC-8","title":"Security and Role-Based Access Control","summary":"Implement security controls and granular role-based access management.","description":"This epic introduces robust security features and role-based access controls (RBAC). It ensures that each user can only view and interact with content and services relevant to their roles or authorization levels. It covers backend enforcement, access policies, and audit mechanisms to ensure compliance with security standards and regulatory requirements.","dependencies":["EPIC-1","EPIC-7"]}]