[{"id":"EPIC-1","title":"User Authentication and Security Framework","summary":"Implement secure user authentication with multi-factor support","description":"Develop a robust authentication framework that allows customers to securely log in using multi-factor authentication, ensuring data protection and compliance with banking security standards. This includes support for password policies, OTP delivery channels, session management, and encryption of sensitive credentials.","dependencies":[]},{"id":"EPIC-2","title":"Responsive User Interface and Experience Design","summary":"Design and develop a responsive and user-friendly portal interface","description":"Create a modern, responsive user interface that adapts seamlessly across desktop, tablet, and mobile devices. The design should focus on simplicity, ease of navigation, accessibility, and consistency in look and feel across platforms, ensuring an optimal experience for customers accessing the portal.","dependencies":[]},{"id":"EPIC-3","title":"Personalized Dashboard and Customer Profile Management","summary":"Build a dynamic dashboard showcasing relevant banking products and services","description":"Develop a personalized dashboard that displays the user's account information, product eligibility, and recommended banking services based on customer profiles. The dashboard should adapt dynamically to reflect real-time data and provide intuitive access to commonly used features.","dependencies":["EPIC-1","EPIC-2"]},{"id":"EPIC-4","title":"Account Opening and Service Request Workflows","summary":"Enable streamlined digital account opening and service modification processes","description":"Implement digital workflows that allow customers to open new accounts or request modifications to existing services online. The process should require minimal clicks, automate form filling using stored data, and provide clear step-by-step guidance throughout the application journey.","dependencies":["EPIC-3"]},{"id":"EPIC-5","title":"Real-Time Status Tracking and Notifications","summary":"Provide real-time updates and notifications for customer requests","description":"Introduce a system for customers to track the real-time status of their account opening or service requests. Integrate automated email notifications and portal alerts to keep users informed at key process stages, enhancing transparency and customer engagement.","dependencies":["EPIC-4"]},{"id":"EPIC-6","title":"Document Upload and Management","summary":"Allow secure document submission for service requests and applications","description":"Develop an integrated document management feature enabling customers to upload, preview, and manage required documentation directly via the portal. Ensure secure file transmission and storage, conforming to data protection and compliance standards.","dependencies":["EPIC-4"]},{"id":"EPIC-7","title":"Save and Resume Application Feature","summary":"Enable customers to pause and continue incomplete processes","description":"Create functionality that allows users to save partially completed account opening or service request forms and resume them later without data loss. This feature should securely store draft data and ensure that the user's progress is easily recoverable upon next login.","dependencies":["EPIC-4"]},{"id":"EPIC-8","title":"Core Banking System Integration Layer","summary":"Integrate the self-service portal with existing core banking systems","description":"Develop a robust integration layer with the bank's existing core banking infrastructure to ensure seamless data synchronization. The integration should handle data exchange for account management, transaction details, and service requests, ensuring high availability and real-time data accuracy.","dependencies":["EPIC-3","EPIC-4"]},{"id":"EPIC-9","title":"Customer Interaction History and Reporting","summary":"Maintain a detailed record of all customer activities and interactions","description":"Implement a comprehensive history module to log and display all user interactions, applications, and service requests. The portal should allow customers to review their historical actions while enabling support and audit teams to analyze activity patterns to improve services.","dependencies":["EPIC-4","EPIC-8"]},{"id":"EPIC-10","title":"Role-Based Access Control and Authorization","summary":"Ensure appropriate access to portal features based on user roles","description":"Design and implement a robust role-based access control mechanism that restricts visibility and access to features based on the customer’s profile and authorization level. This ensures regulatory compliance and tailored user experience aligned with the customer's role and entitlements.","dependencies":["EPIC-1","EPIC-3"]},{"id":"EPIC-11","title":"System Database and Performance Optimization","summary":"Develop a separate, optimized database for portal performance and reliability","description":"Create an independent database architecture dedicated to the portal’s performance, ensuring responsiveness and scalability. Introduce data caching, indexing, and maintenance policies to optimize system reliability and minimize load on the core banking system.","dependencies":["EPIC-8"]}]