[{"id":"EPIC-1","title":"Secure Multi-Factor Authentication System","summary":"Develop a secure authentication system with multiple verification factors for safe user access.","description":"This epic involves implementing a security layer for user authentication that includes both primary (username and password) and secondary (multi-factor) verification methods. The system will support OTP via email/SMS and app-based or biometric authentication. It will ensure adherence to banking and data protection regulations, employ encryption protocols, and protect against unauthorized access through session management, anti-phishing mechanisms, and brute-force detection.","dependencies":[]},{"id":"EPIC-2","title":"Responsive and Accessible Portal Design","summary":"Create an intuitive and responsive user interface compatible across devices.","description":"This epic focuses on designing and developing a responsive, cross-platform, and accessible user interface for the banking portal. It ensures consistent user experience across desktop, tablet, and mobile devices. The design will follow accessibility standards for users with different needs, featuring optimized layouts, intuitive navigation flows, quick access to core functions, and compliance with usability best practices.","dependencies":[]},{"id":"EPIC-3","title":"Personalized Dashboard with Profile-Based Services","summary":"Build a personalized dashboard offering tailored banking products and services.","description":"This epic delivers a personalized dashboard that provides users with relevant information and services based on their account data, eligibility, and preferences. It will display summaries of active accounts, tailored product recommendations, and shortcuts to key actions. Real-time data will be fetched via integrations to ensure accuracy. Custom widgets allow users to configure their dashboard for an optimized, personalized experience.","dependencies":["EPIC-1","EPIC-2"]},{"id":"EPIC-4","title":"Digital Account Opening and Service Modification Workflows","summary":"Enable customers to perform account opening and service modification through guided workflows.","description":"This epic focuses on enabling customers to digitally submit requests for new account openings and service modifications. Streamlined workflows will use form auto-fills, real-time validations, and guided steps that minimize user effort while ensuring accuracy. The workflows will integrate with backend systems for approval and audit tracking, providing a paperless, compliant, and user-friendly experience.","dependencies":["EPIC-3"]},{"id":"EPIC-5","title":"Save and Resume Feature for Applications","summary":"Allow users to save incomplete applications and resume them later without data loss.","description":"This epic introduces functionality that enables users to save any ongoing account or service requests, preserving form data securely for later completion. Saved applications will be accessible from the user’s dashboard and can be resumed seamlessly. The system will auto-save progress periodically and ensure encryption for stored partial data to prevent unauthorized access or tampering.","dependencies":["EPIC-4"]},{"id":"EPIC-6","title":"Secure Document Upload Module","summary":"Enable users to upload supporting documents securely through the portal.","description":"This epic introduces secure document management capabilities that allow users to upload and manage personal or financial documents during account opening or modification processes. Features include validation for accepted file formats, encryption in transit and at rest, version control for re-uploads, and secure access linked to authenticated user sessions. Uploaded files will integrate into backend verification workflows automatically.","dependencies":["EPIC-4"]},{"id":"EPIC-7","title":"Real-Time Status Tracking and Notifications","summary":"Provide live status updates and notifications for customer requests.","description":"This epic enables real-time tracking of submitted account openings, modifications, and other service requests. Users can view the progress of each request on their dashboard and receive automated email or push notifications for updates such as submission, approval, or rejection. The notification module ensures transparency and keeps customers informed without requiring manual inquiry.","dependencies":["EPIC-4"]},{"id":"EPIC-8","title":"Comprehensive Interaction History and Audit Trail","summary":"Maintain a detailed log of all customer interactions for transparency and compliance.","description":"This epic establishes a full audit trail within the self-service portal, capturing all user activities, submitted requests, document uploads, and updates. Customers can view their interaction history in an organized, chronological format, while audit logs are maintained for compliance and internal monitoring. The feature ensures traceability of actions for both security and regulatory reporting.","dependencies":["EPIC-7"]},{"id":"EPIC-9","title":"Core Banking System Integration","summary":"Integrate the self-service portal with the bank’s existing core systems for data synchronization.","description":"This epic focuses on ensuring seamless integration between the customer portal and the core banking system through secure APIs and middleware. It enables real-time data consistency for accounts, services, and transactions. Integration includes two-way data exchange and synchronization for account data, service requests, and verification updates, ensuring all actions performed on the portal reflect accurately in the core system.","dependencies":["EPIC-4","EPIC-6","EPIC-7"]},{"id":"EPIC-10","title":"Independent Database and System Optimization","summary":"Develop an independent, high-performance database for portal operations.","description":"This epic covers the design and implementation of a dedicated database optimized for speed, scalability, and security. The database will handle session data, user requests, documents, and transaction history independently from the core banking system while syncing periodically to ensure consistency. Optimization techniques like caching, indexing, and replication will ensure high performance and reliability under heavy loads.","dependencies":["EPIC-9"]},{"id":"EPIC-11","title":"Role-Based Access Control and Permissions Framework","summary":"Implement role-based security to restrict access based on authorization levels.","description":"This epic introduces a secure role-based access control (RBAC) framework that defines permissions and authorization levels for different user roles such as customers, bank representatives, and admins. Each role will have distinct access privileges for viewing data and performing operations. The RBAC policy enforces least-privilege principles and ensures that sensitive financial data remains accessible only to authorized users.","dependencies":["EPIC-1","EPIC-9"]}]