[{"id":"EPIC-1","title":"Secure Multi-Factor Authentication","summary":"Implement robust multi-factor authentication (MFA) to ensure secure portal login and user identity verification.","description":"Develop and deploy a secure authentication system that supports multiple verification factors such as passwords, OTPs, email verification codes, and authenticator apps. Incorporate secure session management, account recovery mechanisms, and persistent logging for suspicious login attempts. Ensure compliance with banking security and data protection standards (e.g., PCI DSS) to safeguard customer information and prevent unauthorized access.","dependencies":[]},{"id":"EPIC-2","title":"Personalized Banking Dashboard","summary":"Create a dynamic and personalized dashboard tailored to each user's profile and product eligibility.","description":"Design a user-centric dashboard that consolidates account balances, recent transactions, product recommendations, and key updates. The dashboard should use data-driven personalization based on customer profiles and eligibility criteria, highlighting accessible services and offers. Prioritize ease of navigation, clarity, and speed, ensuring that customers have a central interface to manage their banking relationships efficiently.","dependencies":["EPIC-1"]},{"id":"EPIC-3","title":"Responsive and Accessible User Interface Design","summary":"Ensure a modern, responsive design that provides a consistent and accessible experience across all devices.","description":"Develop a fully responsive and device-agnostic interface that adapts automatically to desktops, tablets, and mobile screens. Adhere to accessibility guidelines (e.g., WCAG 2.1) to ensure inclusivity and usability for people with disabilities. Implement performance optimizations for reduced load times and leverage intuitive navigation structures, ensuring ease of use for both first-time and experienced customers.","dependencies":[]},{"id":"EPIC-4","title":"Account Opening and Service Modification Workflows","summary":"Enable customers to open new accounts and modify services through guided, interactive workflows.","description":"Develop seamless workflows that allow customers to submit account opening requests and modify existing services online. Each workflow must minimize manual input through pre-filled fields and step-by-step automation, supporting banking compliance protocols such as KYC and AML. Integrate workflow logic for routing and approval processes while providing interactive validation feedback to ensure smooth completion and accuracy.","dependencies":["EPIC-1","EPIC-2"]},{"id":"EPIC-5","title":"Save and Resume Incomplete Applications","summary":"Allow customers to save incomplete applications and resume them from any device securely.","description":"Implement save-state functionality that captures form progress and securely stores the data in an encrypted session or server-side system. Customers should be able to pause an account opening or service modification process and return later to complete it without data loss. Authenticate users upon resumption to ensure privacy and integrity, aligning with data retention and compliance mandates.","dependencies":["EPIC-4"]},{"id":"EPIC-6","title":"Document Upload and Secure Storage","summary":"Enable customers to upload and manage supporting documents directly through the portal.","description":"Develop a secure document upload feature that supports the submission of verification files in approved formats (e.g., PDF, JPEG, PNG). Incorporate encryption in transit and at rest, virus scanning, and data validation for document authenticity. Allow users to view uploaded files, replace documents, and track their submission status, ensuring full traceability for compliance with banking regulations.","dependencies":["EPIC-4"]},{"id":"EPIC-7","title":"Real-Time Request Tracking and Notifications","summary":"Implement live request tracking and automated notifications for application updates and approvals.","description":"Build a tracking mechanism to monitor all open customer requests, such as account applications, service updates, and product modifications. Provide real-time visibility through progress indicators and dashboards while sending automated email or SMS notifications for major status changes. Ensure event-driven communication via reliable messaging queues, improving transparency and user engagement.","dependencies":["EPIC-4"]},{"id":"EPIC-8","title":"Comprehensive Interaction Log and Audit Trail","summary":"Maintain detailed logs of all user activities and interactions for compliance and transparency.","description":"Implement a robust logging system that tracks every customer action within the portal, including logins, data submissions, document uploads, and tracked requests. Ensure that audit logs are immutable, encrypted, and timestamped for regulatory compliance. Provide an admin interface for authorized personnel to review audit trails and support operational and compliance audits effectively.","dependencies":["EPIC-1","EPIC-2"]},{"id":"EPIC-9","title":"Integration with Core Banking Systems","summary":"Integrate the self-service portal with the existing core banking platform for data synchronization.","description":"Develop integration between the front-end portal and the bank’s core systems using secure APIs or middleware services. Synchronize account data, balances, product eligibility, and transactional updates in real time. Implement error handling, retry queues, and monitoring to ensure reliable data exchange while maintaining data integrity. Ensure compliance with security frameworks and optimize for performance.","dependencies":["EPIC-4","EPIC-7"]},{"id":"EPIC-10","title":"Role-Based Access Control and Permissions Management","summary":"Implement a comprehensive role-based access control (RBAC) system managing access by user type.","description":"Design a structured RBAC framework to define and enforce user permissions based on roles such as customer, banker, and administrator. Ensure that role assignments determine access levels at both interface and API layers. Enable administrative users to manage roles, view assignments, and audit permissions. Apply the principle of least privilege to enhance data security and operational compliance.","dependencies":["EPIC-1"]},{"id":"EPIC-11","title":"Dedicated Portal Database and Performance Optimization","summary":"Develop a high-performance standalone database dedicated to portal operations.","description":"Create a dedicated portal database separated from the core banking systems to handle user sessions, workflows, request states, and logs efficiently. Optimize the database using indexing, caching, and compression techniques for high-speed performance. Implement data encryption, backup, and disaster recovery mechanisms to ensure resilience and protect sensitive information. Regular performance tuning must be conducted to maintain scalability.","dependencies":["EPIC-9"]}]