[{"id":"EPIC-1","title":"Secure Multi-Factor Authentication (MFA)","summary":"Implement a secure login mechanism using multi-factor authentication to protect customer access.","description":"Design and deploy a multi-factor authentication (MFA) system that ensures secure customer access through a combination of credentials such as passwords, OTPs, or biometrics. The system must comply with security standards such as PCI DSS and GDPR, and protect against session hijacking, credential theft, and brute-force attacks. The feature should include secure password recovery, timeout management, and device registration while maintaining a seamless customer experience.","dependencies":[]},{"id":"EPIC-2","title":"Personalized Dashboard Experience","summary":"Develop a dynamic, customer-specific dashboard to display relevant banking information and offerings.","description":"Create a personalized dashboard that provides real-time bank account, product, and eligibility data tailored to each customer’s profile. The dashboard should update dynamically based on customer activities, product interests, and transaction history. It should serve as the primary user interface, giving quick access to features like account summaries, recent transactions, and service requests.","dependencies":["EPIC-1"]},{"id":"EPIC-3","title":"Responsive and Accessible User Interface","summary":"Develop a consistent, accessible, and responsive user interface for all devices.","description":"Build a responsive UI framework that adapts to various devices, including desktop, tablet, and mobile phones. The interface should comply with WCAG 2.1 AA accessibility standards, provide consistent design elements, and include adaptive navigation for touch-based interactions. Focus on load-time optimization, UX simplicity, and mobile-first design principles for accessibility across all customer platforms.","dependencies":[]},{"id":"EPIC-4","title":"Account Opening and Service Modification Workflows","summary":"Provide streamlined digital workflows for account opening and service modification requests.","description":"Implement intuitive and guided workflows that allow users to open new accounts or modify existing services online. These workflows should minimize manual inputs by pre-filling data from existing records, validate KYC information automatically, and ensure compliance with banking and AML requirements. Include confirmation steps, progress indicators, and built-in error handling for a smooth digital onboarding and service modification experience.","dependencies":["EPIC-1","EPIC-2"]},{"id":"EPIC-5","title":"Save and Resume Incomplete Applications","summary":"Enable customers to save partially completed forms and resume them later securely.","description":"Develop functionality allowing users to save the progress of applications mid-process and continue later from any authenticated device. Implement secure session recovery, real-time data encryption, and clear reminders about pending or incomplete applications. Ensure that saved information remains protected, and allow users to easily resume from their last saved checkpoint.","dependencies":["EPIC-4"]},{"id":"EPIC-6","title":"Secure Document Upload and Validation","summary":"Allow customers to upload required documentation securely as part of account and service request workflows.","description":"Integrate a document management module that supports secure upload and validation of user documents like proof of identity or income. Uploaded documents must be encrypted both in transit and at rest. Include file type and size validation, malware scanning, rejection handling, and automated notifications for document approval or re-submission when required.","dependencies":["EPIC-4"]},{"id":"EPIC-7","title":"Real-Time Request Tracking and Notifications","summary":"Implement real-time request tracking and automated notifications for customer updates.","description":"Develop a system that enables customers to track their submitted requests (e.g., account openings, modifications) with full visibility into processing stages. The system should send automated notifications via email or SMS for critical updates, approvals, or pending actions. The notifications must use an event-driven messaging framework ensuring delivery reliability and immediate visibility in the customer dashboard.","dependencies":["EPIC-4"]},{"id":"EPIC-8","title":"Comprehensive Interaction History and Audit Trail","summary":"Maintain a complete, secure log of all customer interactions within the self-service portal.","description":"Develop a secure and immutable logging system to record all customer actions, including logins, document uploads, and service requests. Stored logs must include timestamps, transaction IDs, and activity details for audit and compliance reporting. Allow users to access personal interaction history while enabling administrators to perform audits and generate compliance reports as required by banking standards.","dependencies":["EPIC-1","EPIC-2"]},{"id":"EPIC-9","title":"Core Banking System Integration","summary":"Integrate the self-service portal with the existing core banking system for seamless data exchange.","description":"Implement a secure middleware layer using APIs or message brokers to ensure real-time bidirectional data flow between the portal and the core banking platform. Enable synchronization of account data, service request statuses, and product eligibility details. Add performance monitoring, error handling, and retry mechanisms to maintain high reliability during peak times. Guarantee transactional consistency for all customer operations.","dependencies":["EPIC-4","EPIC-7"]},{"id":"EPIC-10","title":"Role-Based Access Control (RBAC)","summary":"Enforce access restrictions based on user roles and authorization levels.","description":"Develop a role-based access control system ensuring each customer, administrator, and staff member can access only the data and services authorized for their role. Allow modular configuration of permissions at function and data levels, perform access audits, and maintain logs of role changes. This system must align with the principles of least privilege and be compatible with existing bank-wide identity management solutions.","dependencies":["EPIC-1"]},{"id":"EPIC-11","title":"Dedicated Portal Database and System Optimization","summary":"Design an independent, optimized database to support portal performance and reliability.","description":"Establish a dedicated database layer optimized to handle portal transactions, workflows, and audit data separately from the core banking system. Implement encryption mechanisms, query optimization, caching, and load balancing for high availability and fast response times. Include backup and disaster recovery strategies to ensure business continuity while maintaining data consistency with integrated systems.","dependencies":["EPIC-9"]}]