[{"id":"EPIC-1","title":"Secure User Authentication and Multi-Factor Login","summary":"Implement a secure customer authentication process using multi-factor login mechanisms.","description":"Develop a robust authentication system for the self-service banking portal that ensures security through multi-factor authentication (MFA). Customers must be able to log in using their credentials and an additional verification factor such as OTP or biometric verification. The authentication flow should adhere to compliance standards, encrypt sensitive data, and include secure session management to protect against unauthorized access.","dependencies":[],"userStories":[{"id":"US-1.1","title":"Login with Credentials","description":"As a customer, I want to log in using my username and password so that I can securely access my banking account."},{"id":"US-1.2","title":"Multi-Factor Authentication (MFA) Setup","description":"As a customer, I want to enable and verify multi-factor authentication using methods like OTP or biometrics so that my login remains secure."},{"id":"US-1.3","title":"Session Timeout and Auto Logout","description":"As a customer, I want my session to automatically log out after inactivity so that my account stays secure."}]},{"id":"EPIC-2","title":"Responsive and Accessible Portal Design","summary":"Develop a responsive and user-friendly portal accessible across multiple devices and screen sizes.","description":"Create a modern, user-friendly interface that provides an intuitive navigation experience across devices such as desktops, tablets, and mobile phones. The design should prioritize usability, responsiveness, and accessibility compliance (WCAG 2.1) to ensure all customer segments, including those with disabilities, can seamlessly use the platform.","dependencies":[],"userStories":[{"id":"US-2.1","title":"Responsive Layout","description":"As a customer, I want the portal to adjust automatically to my device screen size so that I can access and perform actions easily whether on mobile or desktop."},{"id":"US-2.2","title":"Accessibility Features","description":"As a differently-abled customer, I want to use accessibility features like screen readers and high contrast so that I can navigate the portal easily."}]},{"id":"EPIC-3","title":"Personalized Dashboard and Customer Insights","summary":"Provide a personalized dashboard with banking products, services, and customer information.","description":"Design a personalized dashboard displaying dynamic content such as account balances, available products, upcoming due payments, and recommendations based on customer profiles and eligibility. The dashboard should empower customers to access key actions quickly and review relevant alerts or financial insights.","dependencies":["EPIC-1","EPIC-2"],"userStories":[{"id":"US-3.1","title":"Display Account Overview","description":"As a customer, I want to view my active banking accounts, transactions, and balances from the dashboard so that I can monitor my finances conveniently."},{"id":"US-3.2","title":"Show Personalized Recommendations","description":"As a customer, I want to see banking products suitable for me based on my eligibility so that I can explore relevant services."}]},{"id":"EPIC-4","title":"Online Account Opening and Service Modification Workflows","summary":"Enable online account opening and service modification requests through simplified workflows.","description":"Develop interactive workflows that allow customers to open new accounts and submit service modification requests directly from the portal. The process should be intuitive, require minimal user input, and guide users through each step seamlessly with built-in validations and document requirements.","dependencies":["EPIC-3"],"userStories":[{"id":"US-4.1","title":"Online Account Opening","description":"As a customer, I want to open a new account online so that I can complete the process without visiting the branch."},{"id":"US-4.2","title":"Submit Service Modification","description":"As a customer, I want to request changes to my existing services or update details digitally so that I can manage them conveniently."}]},{"id":"EPIC-5","title":"Secure Document Upload and Verification","summary":"Implement a secure document management system enabling uploads for verification purposes.","description":"Enable customers to upload required identification or supporting documents within the portal securely. Ensure all uploads are encrypted, scanned for malware, validated for supported formats, and stored in compliance with data protection guidelines. Provide confirmation and retrieval functionality for user reference.","dependencies":["EPIC-4"],"userStories":[{"id":"US-5.1","title":"Upload Supporting Documents","description":"As a customer, I want to upload the documents required for account opening or service modification so that my requests can be processed efficiently."},{"id":"US-5.2","title":"View Uploaded Documents","description":"As a customer, I want to review and confirm uploaded documents so that I can ensure completeness and correctness."}]},{"id":"EPIC-6","title":"Save and Resume Application Progress","summary":"Allow customers to save and resume unfinished applications seamlessly.","description":"Implement a feature where customers can save their in-progress account opening or service requests and resume from where they left off. All partially completed data must be securely stored and retrievable only by the authenticated user, ensuring no data loss or unauthorized access.","dependencies":["EPIC-4"],"userStories":[{"id":"US-6.1","title":"Save Incomplete Application","description":"As a customer, I want to save a partially completed application so that I can continue it later at my convenience."},{"id":"US-6.2","title":"Resume Saved Applications","description":"As a customer, I want to resume my saved application easily so that I don’t have to restart the entire process."}]},{"id":"EPIC-7","title":"Real-Time Status Tracking and Notifications","summary":"Provide immediate feedback and real-time notifications for all user requests.","description":"Develop a notification engine to provide users with instant status updates on submitted applications and requests. Statuses should be viewable in the portal and communicated via email or SMS. Notifications should be triggered for key events such as submission, approval, rejection, or additional document requirements.","dependencies":["EPIC-4"],"userStories":[{"id":"US-7.1","title":"View Request Status Updates","description":"As a customer, I want to track the progress of my submitted requests in real time so that I’m aware of their current status."},{"id":"US-7.2","title":"Email and Portal Notifications","description":"As a customer, I want to receive email and in-portal notifications when there are updates to my request so that I stay informed."}]},{"id":"EPIC-8","title":"User Activity History and Audit Logs","summary":"Maintain a comprehensive and secure record of all customer activities.","description":"Implement detailed tracking and logging mechanisms to record user activities, request histories, and document submissions. Enable customers to view their interaction history, while administrators should have access to immutable audit logs for compliance, dispute resolution, and performance tracking.","dependencies":["EPIC-4"],"userStories":[{"id":"US-8.1","title":"View Interaction and Request History","description":"As a customer, I want to view a complete history of my submitted requests and activities so that I can reference previous interactions."},{"id":"US-8.2","title":"Maintain Immutable Audit Logs","description":"As a compliance officer, I want all system actions to be securely logged so that audits and investigations can be conducted as needed."}]},{"id":"EPIC-9","title":"Core Banking Integration","summary":"Integrate the self-service portal with the bank’s existing core banking systems.","description":"Establish secure API and middleware-level integration between the self-service portal and the core banking system for real-time data synchronization. This ensures customers can view real-time account data, submit requests directly to back-office systems, and eliminate redundancies.","dependencies":["EPIC-7"],"userStories":[{"id":"US-9.1","title":"Real-Time Data Sync with Core Banking","description":"As a customer, I want the portal to show updated and accurate banking data from the core system so that I can trust the information presented."},{"id":"US-9.2","title":"Secure Core System Integration","description":"As a developer, I want the portal to communicate securely with core banking through APIs so that data integrity and system security are maintained."}]},{"id":"EPIC-10","title":"Independent Portal Database and Performance Optimization","summary":"Create a dedicated database architecture for the self-service portal.","description":"Build and maintain a performance-optimized database that ensures scalability, security, and efficiency for portal operations. The dedicated database should handle user-specific data, minimize dependency on core banking systems, and include backup and recovery mechanisms.","dependencies":["EPIC-9"],"userStories":[{"id":"US-10.1","title":"Independent Database Setup","description":"As a system architect, I want to set up a dedicated portal database that stores user data securely and ensures high portal performance."}]},{"id":"EPIC-11","title":"Role-Based Access Control (RBAC)","summary":"Implement a role-based authorization system ensuring secure and appropriate access levels.","description":"Apply role-based access controls to restrict customers, administrators, and bank employees to appropriate views and actions within the portal. Define roles, permissions, and hierarchies dynamically to enhance system security and comply with access governance policies.","dependencies":["EPIC-1","EPIC-9"],"userStories":[{"id":"US-11.1","title":"Define and Assign Roles","description":"As an administrator, I want to define access levels for different user groups so that each role can only view or modify relevant data."},{"id":"US-11.2","title":"Restrict Customer Access","description":"As a customer, I want to only view features and information assigned to my profile so that my access remains appropriately limited."}]}]