[{"epic_title":"Secure Authentication and Access Control","epic_key":"EPIC-1","number":1,"title":"Implement Multi-Factor Authentication (MFA) Methods","description":"As a customer, I want to log in using multi-factor authentication methods, so that my account access is secure.","priority_business_value":"High","attributes_and_rules":"MFA methods should include SMS, email OTP, or authentication applications. Data must be encrypted both in transit and at rest.","core_domain_objects":"Customer Account, MFA Methods","acceptance_criteria":"1. MFA method is prompt during login. 2. Successfully authenticate using different MFA options.","test_cases":"Given a customer with an account, When they attempt to log in, Then they are prompted to complete MFA using SMS, email OTP, or authentication application."},{"epic_title":"Secure Authentication and Access Control","epic_key":"EPIC-1","number":2,"title":"Implement Role-Based Access Controls (RBAC)","description":"As a system administrator, I want to restrict system access based on user roles, so that unauthorized access is prevented.","priority_business_value":"High","attributes_and_rules":"Access controls should be based on customer profiles and authorization levels.","core_domain_objects":"User Roles, Customer Profiles","acceptance_criteria":"1. Roles are defined and assigned. 2. Users can only access resources allowed by their roles.","test_cases":"Given a user with a specific role, When they log in, Then they can access only the resources and functionalities authorized for their role."},{"epic_title":"Responsive and Accessible Portal Interface","epic_key":"EPIC-2","number":1,"title":"Design a Responsive Portal Interface","description":"As a user, I want the portal interface to be responsive, so that I can access it seamlessly on any device.","priority_business_value":"High","attributes_and_rules":"Ensure consistency in layout and user experience across desktops, tablets, and mobile devices.","core_domain_objects":"Portal Interface, User Device","acceptance_criteria":"1. The portal interface adapts to different screen sizes and resolutions. 2. User experience is consistent across devices.","test_cases":"Given any device, When a user accesses the portal, Then the interface adapts to the device’s screen size and resolution."},{"epic_title":"Responsive and Accessible Portal Interface","epic_key":"EPIC-2","number":2,"title":"Ensure Portal Compliance with Accessibility Standards","description":"As a user with disabilities, I want the portal to comply with accessibility standards, so that I can access and use it without barriers.","priority_business_value":"High","attributes_and_rules":"Comply with accessibility standards such as WCAG 2.1.","core_domain_objects":"Portal Interface, Accessibility Standards","acceptance_criteria":"1. The portal meets WCAG 2.1 compliance. 2. Users with disabilities can navigate and use the portal features.","test_cases":"Given a user with disabilities, When they interact with the portal, Then they can access all features according to WCAG 2.1 standards."},{"epic_title":"Personalized Customer Dashboard","epic_key":"EPIC-3","number":1,"title":"Develop a Personalized Dashboard","description":"As a customer, I want a personalized dashboard, so that I can see relevant banking products and services.","priority_business_value":"High","attributes_and_rules":"Dashboard should present personalized overview based on user profiles and eligibility.","core_domain_objects":"Dashboard, User Profiles","acceptance_criteria":"1. Dashboard displays relevant products based on user profile. 2. Data is updated in real-time.","test_cases":"Given a customer profile, When they access the dashboard, Then relevant products and services based on their profile are displayed."},{"epic_title":"Digital Account Opening and Service Modification","epic_key":"EPIC-4","number":1,"title":"Enable Online Account Opening","description":"As a prospective customer, I want to open a new account online, so that I can conveniently start banking with this institution.","priority_business_value":"High","attributes_and_rules":"Workflows should reduce manual input and validate inputs in real-time. Pre-fill applicable data.","core_domain_objects":"Account, Workflow","acceptance_criteria":"1. Customers can start and complete account opening online. 2. Input validation is performed in real-time.","test_cases":"Given a prospective customer, When they fill out the account opening form online, Then the inputs are validated, and the form is pre-filled where applicable."},{"epic_title":"Application Draft and Document Management","epic_key":"EPIC-5","number":1,"title":"Save Incomplete Applications","description":"As a customer, I want to save my partially completed applications, so that I can resume them later at my convenience.","priority_business_value":"Medium","attributes_and_rules":"Partially completed applications should be secure and easy to resume.","core_domain_objects":"Application, Draft","acceptance_criteria":"1. Customers can save incomplete applications. 2. Customers can resume saved applications easily.","test_cases":"Given a customer, When they partially complete an application, Then they can save it and resume it later."},{"epic_title":"Application Draft and Document Management","epic_key":"EPIC-5","number":2,"title":"Enable Secure Document Upload","description":"As a customer, I want to upload necessary documents securely, so that my account opening or service requests can be completed.","priority_business_value":"High","attributes_and_rules":"Ensure files are encrypted and scanned for potential threats. Link documents to user submissions appropriately.","core_domain_objects":"Document, User Submission","acceptance_criteria":"1. Customers can upload necessary documents. 2. Uploaded documents are encrypted and linked correctly to submissions.","test_cases":"Given a customer, When they upload a document, Then the document is encrypted, scanned, and correctly associated with their submission."},{"epic_title":"Real-Time Notifications and Status Tracking","epic_key":"EPIC-6","number":1,"title":"Provide Real-Time Notifications","description":"As a customer, I want to receive real-time notifications on my submitted requests, so that I am always informed about their status.","priority_business_value":"High","attributes_and_rules":"Notifications should cover status changes, approvals, and pending actions via email and in-portal.","core_domain_objects":"Notification, Request","acceptance_criteria":"1. Customers receive notifications for status changes. 2. Notifications are sent via email and in-portal.","test_cases":"Given a customer, When the status of their request changes, Then they receive a notification via email and in-portal."},{"epic_title":"Real-Time Notifications and Status Tracking","epic_key":"EPIC-6","number":2,"title":"Develop Request Tracking Feature","description":"As a customer, I want to track the real-time progress of my applications, so that I can stay updated on the status.","priority_business_value":"Medium","attributes_and_rules":"Track requests and display real-time progress updates.","core_domain_objects":"Request, Tracking","acceptance_criteria":"1. Customers can see real-time updates on their requests. 2. Status changes are accurately reflected in the portal.","test_cases":"Given a submitted request, When the status changes, Then the progress is updated in real-time in the portal."},{"epic_title":"Core Banking System Integration","epic_key":"EPIC-7","number":1,"title":"Integrate Core Banking System with Portal","description":"As a developer, I want to integrate the portal with the core banking system, so that data exchange and updates are seamless and real-time.","priority_business_value":"High","attributes_and_rules":"Use APIs or middleware solutions for real-time synchronization of customer data, account statuses, and transactional updates.","core_domain_objects":"Core Banking System, Portal","acceptance_criteria":"1. Data is exchanged in real-time. 2. Updates are synchronized between the portal and core banking system.","test_cases":"Given updated customer data, When data is changed in the core banking system, Then the portal is updated in real-time."},{"epic_title":"Portal Database and Performance Optimization","epic_key":"EPIC-8","number":1,"title":"Set Up an Independent Portal Database","description":"As a systems architect, I want to set up an independent database for the portal, so that performance and availability are optimized.","priority_business_value":"High","attributes_and_rules":"Optimize data storage, indexing, and caching for fast load times. Ensure database replication and automated backups.","core_domain_objects":"Portal Database","acceptance_criteria":"1. Load times are fast. 2. Database replication and backups are configured. 3. Performance is maintained under heavy user loads.","test_cases":"Given the portal database, When subjected to high user loads, Then load times remain optimal and backups are performed."},{"epic_title":"Comprehensive Interaction and Audit Logging","epic_key":"EPIC-9","number":1,"title":"Implement Audit Logging for User Actions","description":"As a compliance officer, I want a detailed audit log of all user interactions, so that I can ensure compliance and security.","priority_business_value":"High","attributes_and_rules":"Capture login attempts, account requests, modifications, and notifications. Ensure logs are immutable and timestamped.","core_domain_objects":"Audit Log","acceptance_criteria":"1. User actions are logged in detail. 2. Logs are immutable and securely stored. 3. Users can view their history of activities.","test_cases":"Given a user action, When an interaction occurs, Then the action is logged with timestamps and is immutable."}]