[{"epic_title":"User Authentication and Multi-Factor Login","epic_key":"EPIC-1","number":1,"title":"User Registration with Multi-Factor Authentication","description":"As a customer, I want to register using secure multi-factor authentication, so that I can ensure my account is protected.","priority_business_value":"High","attributes_and_rules":"User credentials must be encrypted. Registration requires email verification and OTP.","core_domain_objects":"User, Registration","acceptance_criteria":"User can complete registration by verifying email and an OTP sent to their phone.","test_cases":"Given I am a new user, When I register with my details, And verify my email and OTP, Then my registration is successful."},{"epic_title":"User Authentication and Multi-Factor Login","epic_key":"EPIC-1","number":2,"title":"User Login with Multi-Factor Authentication","description":"As a customer, I want to log in using secure multi-factor authentication, so that I can securely access my account.","priority_business_value":"High","attributes_and_rules":"Login requires password and a second factor (OTP/biometrics). Credentials must be encrypted.","core_domain_objects":"User, Session","acceptance_criteria":"User can log in using password and an additional factor like OTP or biometrics.","test_cases":"Given I am a registered user, When I log in with my credentials and provide the OTP, Then I am granted access to my account."},{"epic_title":"User Authentication and Multi-Factor Login","epic_key":"EPIC-1","number":3,"title":"Password Recovery Workflow","description":"As a customer, I want a password recovery option, so that I can regain access to my account if I forget my password.","priority_business_value":"Medium","attributes_and_rules":"Recovery requires email verification and secure OTP. Credentials must be encrypted.","core_domain_objects":"User","acceptance_criteria":"User can initiate password recovery, verify their identity, and reset their password.","test_cases":"Given I have forgotten my password, When I initiate recovery and verify my identity, Then I can reset my password successfully."},{"epic_title":"User Authentication and Multi-Factor Login","epic_key":"EPIC-1","number":4,"title":"User Logout Functionality","description":"As a customer, I want to securely log out, so that I can ensure no one else can access my account.","priority_business_value":"High","attributes_and_rules":"Session should be removed from server upon logout.","core_domain_objects":"User, Session","acceptance_criteria":"User can log out, and their session is terminated on the server.","test_cases":"Given I am logged in, When I log out, Then my session is ended and access is terminated."},{"epic_title":"Personalized Customer Dashboard","epic_key":"EPIC-2","number":1,"title":"Dashboard Showing Personalized Products and Services","description":"As a customer, I want a personalized dashboard, so that I can see products and services relevant to me.","priority_business_value":"High","attributes_and_rules":"Dashboard should update based on user profile, account data and eligibility.","core_domain_objects":"User, Account, Product","acceptance_criteria":"The dashboard shows personalized product details, offers, and actions.","test_cases":"Given I am logged in, When I access my dashboard, Then I see products and services personalized to my profile."},{"epic_title":"Personalized Customer Dashboard","epic_key":"EPIC-2","number":2,"title":"Widgets for Quick Access to Services","description":"As a customer, I want quick access to frequently used services, so that I can perform tasks efficiently.","priority_business_value":"Medium","attributes_and_rules":"Widgets should include shortcuts to most-used services and pending tasks.","core_domain_objects":"User, Service","acceptance_criteria":"User has widgets on their dashboard for quick access to services.","test_cases":"Given I am on my dashboard, When I look for services, Then I find quick access widgets for my frequently used services."},{"epic_title":"Personalized Customer Dashboard","epic_key":"EPIC-2","number":3,"title":"Visual Indicators for Pending Tasks","description":"As a customer, I want visual indicators for pending tasks, so that I can track my activities and complete them in time.","priority_business_value":"Medium","attributes_and_rules":"Dashboard should highlight pending tasks for user's attention.","core_domain_objects":"User, Task","acceptance_criteria":"Tasks pending completion are clearly indicated on the dashboard.","test_cases":"Given I have pending tasks, When I view my dashboard, Then the pending tasks are prominently displayed."},{"epic_title":"Responsive UI and Cross-Device Compatibility","epic_key":"EPIC-3","number":1,"title":"Responsive Design for Multi-Device Compatibility","description":"As a customer, I want to access the portal on any device, so that I can manage my banking needs seamlessly.","priority_business_value":"High","attributes_and_rules":"UI should be responsive and adapt to any screen size, ensuring usability on desktop, tablets, and mobiles.","core_domain_objects":"Portal, Device","acceptance_criteria":"Portal is consistently usable across desktop, tablet, and mobile devices.","test_cases":"Given I access the portal on different devices, When I navigate around, Then the UI adapts and remains functional and accessible."},{"epic_title":"Responsive UI and Cross-Device Compatibility","epic_key":"EPIC-3","number":2,"title":"Reusable UI Components for Consistency","description":"As a developer, I want reusable UI components, so that I can maintain consistency and reduce development time.","priority_business_value":"Medium","attributes_and_rules":"UI components should be reusable across the portal. Design system should ensure cohesive look and feel.","core_domain_objects":"Portal, Component","acceptance_criteria":"Reusable components are used consistently across the portal.","test_cases":"Given I am developing a feature, When I use the UI components, Then the look and feel remain consistent."},{"epic_title":"Responsive UI and Cross-Device Compatibility","epic_key":"EPIC-3","number":3,"title":"Performance Optimization for Mobile","description":"As a customer, I want the portal to perform efficiently on mobile, so that I can use it effectively on limited bandwidth.","priority_business_value":"High","attributes_and_rules":"Optimize front-end performance for mobile devices. Ensure quick load times and responsive interactions.","core_domain_objects":"Portal, Mobile","acceptance_criteria":"Portal performs efficiently and is accessible on mobile devices, even with limited bandwidth.","test_cases":"Given I access the portal on a mobile device, When I navigate and interact, Then it performs quickly and responds efficiently."},{"epic_title":"Account Opening and Service Request Workflows","epic_key":"EPIC-4","number":1,"title":"Guided Workflow for New Account Opening","description":"As a customer, I want a guided workflow for new account opening, so that I can easily submit my application.","priority_business_value":"High","attributes_and_rules":"Workflow should guide users through steps, auto-fill data where possible, and allow document uploads.","core_domain_objects":"Account, Customer","acceptance_criteria":"User can follow the guided workflow to successfully open a new account.","test_cases":"Given I want to open a new account, When I follow the guided workflow, Then I can submit my application smoothly."},{"epic_title":"Account Opening and Service Request Workflows","epic_key":"EPIC-4","number":2,"title":"Workflow for Service Modifications and Additional Services","description":"As a customer, I want to request service modifications or additional services, so that I can update my banking preferences.","priority_business_value":"Medium","attributes_and_rules":"Workflow should minimize user effort, allow saving incomplete applications, and permit document uploads.","core_domain_objects":"Service, Customer","acceptance_criteria":"User can request modifications or additional services via the guided workflow.","test_cases":"Given I need to modify a service, When I use the workflow, Then I can submit my request and upload required documents."},{"epic_title":"Account Opening and Service Request Workflows","epic_key":"EPIC-4","number":3,"title":"Input Validation and Incomplete Application Saving","description":"As a customer, I want my inputs validated and the ability to save incomplete applications, so that I can ensure accuracy and convenience.","priority_business_value":"High","attributes_and_rules":"Validate user inputs and allow saving of incomplete applications for later completion.","core_domain_objects":"Application, Customer","acceptance_criteria":"Inputs are validated, and users can save incomplete applications.","test_cases":"Given I start a new application, When I provide inputs, Then my inputs are validated and I can save the application midway."},{"epic_title":"Real-Time Notifications and Request Tracking","epic_key":"EPIC-5","number":1,"title":"Real-Time Status Tracking for Requests","description":"As a customer, I want to track the status of my requests in real-time, so that I can stay informed about their progress.","priority_business_value":"High","attributes_and_rules":"Provide real-time updates and status tracking for all user requests.","core_domain_objects":"Request, Status","acceptance_criteria":"Users can see real-time status updates for their submitted requests.","test_cases":"Given I have submitted a request, When I check the status, Then I see real-time updates about its progress."},{"epic_title":"Real-Time Notifications and Request Tracking","epic_key":"EPIC-5","number":2,"title":"Email Notifications for Request Updates","description":"As a customer, I want to receive email notifications for request updates, so that I am aware of any changes or required actions.","priority_business_value":"Medium","attributes_and_rules":"Send email notifications for request status changes and actions required.","core_domain_objects":"Request, Notification","acceptance_criteria":"Users receive email notifications for any updates or required actions on their requests.","test_cases":"Given I have a pending request, When its status changes, Then I receive an email notification about the update."},{"epic_title":"Real-Time Notifications and Request Tracking","epic_key":"EPIC-5","number":3,"title":"On-Portal Alerts for Request Updates","description":"As a customer, I want to see alerts on the portal for request updates, so that I can quickly respond to any required actions.","priority_business_value":"Medium","attributes_and_rules":"Display on-portal alerts for request updates and actions needed from the user.","core_domain_objects":"Request, Alert","acceptance_criteria":"Users see on-portal alerts for any updates or actions required on their requests.","test_cases":"Given I have a pending request, When its status changes, Then I see an alert on the portal notifying me of the update."}]