[{"epic_title":"Secure Multi-Factor Authentication System","epic_key":"EPIC-1","number":1,"title":"Implement Multi-Factor Authentication","description":"As a customer, I want to securely log in using multiple verification methods so that my account remains protected.","priority_business_value":"High","attributes_and_rules":"Verify identity through SMS, email, or authenticator apps. Comply with banking security and regulatory standards.","core_domain_objects":"Verification Methods, Session Management, Identity Management","acceptance_criteria":"Customers can log in using multi-factor authentication with different verification methods.","test_cases":"Given a customer, When they try to log in, Then the system should prompt for a second verification method."},{"epic_title":"Secure Multi-Factor Authentication System","epic_key":"EPIC-1","number":2,"title":"Implement Session Timeouts","description":"As a customer, I want session timeouts after a period of inactivity so that my session remains secure.","priority_business_value":"High","attributes_and_rules":"Force session timeouts after predefined periods of inactivity.","core_domain_objects":"Session Management","acceptance_criteria":"Session expires and requires re-login after the idle timeout period.","test_cases":"Given a logged-in session, When the period of inactivity exceeds the limit, Then the session should be timed out, requiring re-login."},{"epic_title":"Secure Multi-Factor Authentication System","epic_key":"EPIC-1","number":3,"title":"Implement Account Lockout after Repeated Failed Attempts","description":"As a customer, I want my account to be locked after several failed login attempts so that unauthorized access is prevented.","priority_business_value":"High","attributes_and_rules":"Lock account after a set number of failed attempts.","core_domain_objects":"Account Security","acceptance_criteria":"Account is locked after a specific number of failed login attempts.","test_cases":"Given multiple failed login attempts, When the number of attempts exceeds the threshold, Then the account should be locked."},{"epic_title":"Personalized Customer Dashboard","epic_key":"EPIC-2","number":1,"title":"Display Personalized Content on Dashboard","description":"As a customer, I want to see personalized content based on my banking profile and eligibility so that I can access relevant information easily.","priority_business_value":"Medium","attributes_and_rules":"Display customer-specific data and product recommendations.","core_domain_objects":"Customer Data, Banking Products, Dashboard Widgets","acceptance_criteria":"Dashboard shows personalized content dynamically.","test_cases":"Given a customer's profile data, When the dashboard loads, Then display personalized content according to the customer's eligibility."},{"epic_title":"Responsive and Accessible User Interface","epic_key":"EPIC-3","number":1,"title":"Implement Responsive Design","description":"As a user, I want the portal to be responsive across all device types so that I can use it seamlessly on different screens.","priority_business_value":"Medium","attributes_and_rules":"Use responsive UI frameworks. Adjust layouts automatically.","core_domain_objects":"UI Components","acceptance_criteria":"User interface adjusts seamlessly to different screen sizes.","test_cases":"Given a device with various screen sizes, When the user accesses the portal, Then the interface should adjust and provide a consistent experience."},{"epic_title":"Responsive and Accessible User Interface","epic_key":"EPIC-3","number":2,"title":"Comply with Accessibility Guidelines","description":"As a user with disabilities, I want the portal to comply with WCAG 2.1 guidelines so that I can access all features.","priority_business_value":"Medium","attributes_and_rules":"Follow WCAG 2.1 standards. Ensure accessibility for all users.","core_domain_objects":"Accessibility Features","acceptance_criteria":"Portal meets WCAG 2.1 accessibility standards.","test_cases":"Given WCAG 2.1 criteria, When users with disabilities access the portal, Then they should be able to use all functionalities."},{"epic_title":"Online Account Opening and Service Modification Workflows","epic_key":"EPIC-4","number":1,"title":"Develop Guided Workflow for Account Opening","description":"As a customer, I want a guided workflow to open new accounts online so that I can complete the process efficiently.","priority_business_value":"High","attributes_and_rules":"Include form validations and automated KYC/AML verification.","core_domain_objects":"Account Opening Workflow, KYC/AML Verification","acceptance_criteria":"Account opening workflow is available and guided.","test_cases":"Given a new account application, When the user follows the guided workflow, Then the process should be validated and completed as per regulations."},{"epic_title":"Online Account Opening and Service Modification Workflows","epic_key":"EPIC-4","number":2,"title":"Enable Service Modification through Portal","description":"As a customer, I want to modify my current services online so that I can manage my banking products conveniently.","priority_business_value":"Medium","attributes_and_rules":"Provide step-by-step guidance for service modification.","core_domain_objects":"Service Modification Workflow","acceptance_criteria":"Service modification can be completed online in guided steps.","test_cases":"Given existing services, When the user wants to modify them, Then the guided workflow should allow modifications efficiently."},{"epic_title":"Save and Resume Application Functionality","epic_key":"EPIC-5","number":1,"title":"Allow Save and Resume of In-Progress Applications","description":"As a customer, I want the ability to save my incomplete application and resume it later so that I don't lose progress.","priority_business_value":"High","attributes_and_rules":"Persist data securely and allow resumes from any device.","core_domain_objects":"Application State, Secure Storage","acceptance_criteria":"Applications can be saved and resumed securely.","test_cases":"Given an in-progress application, When the user saves the application, Then the same user should be able to resume it later from any device."},{"epic_title":"Document Upload and Verification Module","epic_key":"EPIC-6","number":1,"title":"Implement Secure Document Upload Functionality","description":"As a customer, I want to upload documents securely as part of the application process so that my information is verified.","priority_business_value":"High","attributes_and_rules":"Encrypt, virus-scan, and validate uploaded documents.","core_domain_objects":"Document Upload Module, Validation Engine","acceptance_criteria":"Document upload feature is secure and validates the uploaded files.","test_cases":"Given document upload requirements, When the user uploads a document, Then the system should encrypt, scan, and validate the file."},{"epic_title":"Real-Time Request Tracking and Notifications","epic_key":"EPIC-7","number":1,"title":"Enable Real-Time Request Tracking and Notifications","description":"As a customer, I want to track the status of my requests in real-time and receive notifications so that I am updated on the progress.","priority_business_value":"High","attributes_and_rules":"Provide real-time updates and notifications via SMS/email.","core_domain_objects":"Request Tracking System, Notification System","acceptance_criteria":"Customers can track requests in real-time and receive notifications.","test_cases":"Given a request submission, When the status changes, Then the customer should be notified via SMS/email."},{"epic_title":"Comprehensive Interaction History and Audit Trail","epic_key":"EPIC-8","number":1,"title":"Maintain Detailed Interaction History","description":"As a customer, I want to access my interaction history within the portal so that I can review my activities.","priority_business_value":"Medium","attributes_and_rules":"Record and store immutable, timestamped audit logs.","core_domain_objects":"Audit Trail, Interaction Logs","acceptance_criteria":"Interaction history is recorded and accessible to customers.","test_cases":"Given user activities, When actions are performed, Then they should be logged in a detailed, immutable audit trail."},{"epic_title":"Core Banking System Integration","epic_key":"EPIC-9","number":1,"title":"Integrate Portal with Core Banking System","description":"As a bank, I want the portal to synchronize data with the core banking system so that real-time information is available to customers.","priority_business_value":"High","attributes_and_rules":"Ensure bidirectional communication, error handling, and data consistency.","core_domain_objects":"Core Banking System, Integration API","acceptance_criteria":"Data is synchronized in real-time between the portal and core banking system.","test_cases":"Given core banking data, When changes occur, Then the portal should reflect these changes in real-time."},{"epic_title":"Role-Based Access Control and Authorization","epic_key":"EPIC-10","number":1,"title":"Implement Role-Based Access Control","description":"As an administrator, I want to configure role-based access control so that permissions are managed per user role.","priority_business_value":"High","attributes_and_rules":"Restrict visibility and permissions based on user roles.","core_domain_objects":"Role Management, Access Control","acceptance_criteria":"Permissions and feature visibility are controlled by user roles.","test_cases":"Given user roles, When different users login, Then their access should be restricted based on the assigned role."},{"epic_title":"Dedicated Portal Database and Performance Optimization","epic_key":"EPIC-11","number":1,"title":"Set Up Dedicated Portal Database","description":"As a developer, I want a dedicated database for the portal so that performance is optimized and reliability is maintained.","priority_business_value":"Medium","attributes_and_rules":"Create dedicated database architecture and implement performance optimizations.","core_domain_objects":"Portal Database, Performance Monitoring","acceptance_criteria":"Portal database is optimized for performance and reliability.","test_cases":"Given the portal database, When performance is monitored, Then it should show optimized response times and reliability."}]