[{"epic_title":"Secure Authentication and Role-Based Access","epic_key":"EPIC-1","number":1,"title":"Implement Multi-Factor Authentication (MFA)","description":"As a customer, I want to use multi-factor authentication during login, so that my account remains secure.","priority_business_value":"High","attributes_and_rules":"The system should allow customers to enable MFA using SMS, email, or authenticator apps.","core_domain_objects":"MFA, User, Session","acceptance_criteria":"1. The customer should be prompted for a second factor during login. 2. The system should store customer MFA preferences securely.","test_cases":"Given a user with MFA enabled, When they log in, Then they should be prompted for a second authentication factor."},{"epic_title":"Secure Authentication and Role-Based Access","epic_key":"EPIC-1","number":2,"title":"Configure Role-Based Access Control (RBAC)","description":"As an administrator, I want to configure role-based access, so that user permissions are controlled based on their roles.","priority_business_value":"High","attributes_and_rules":"Roles should include Admin, Customer, and Support. Permissions should be assigned accordingly.","core_domain_objects":"User, Role, Permission","acceptance_criteria":"1. Admins should assign roles to users. 2. Users should have access permissions based on their roles.","test_cases":"Given a user with a specific role, When they access the portal, Then they should have permissions according to their role."},{"epic_title":"Responsive and Intuitive User Interface","epic_key":"EPIC-2","number":1,"title":"Design a Responsive User Interface","description":"As a customer, I want the interface to adapt to my device, so that I have a seamless experience.","priority_business_value":"Medium","attributes_and_rules":"The interface should be optimized for desktop, tablet, and mobile devices.","core_domain_objects":"User Interface, Device","acceptance_criteria":"1. The interface should be responsive. 2. The layout should be consistent across devices.","test_cases":"Given a user accessing the portal on different devices, When they navigate the portal, Then the interface should adapt to their device screen size."},{"epic_title":"Personalized Dashboard and Product Visibility","epic_key":"EPIC-3","number":1,"title":"Develop a Personalized Dashboard","description":"As a customer, I want a dashboard displaying my banking information, so that I can view my account details and relevant offers.","priority_business_value":"High","attributes_and_rules":"The dashboard should show account summaries, available services, and product recommendations.","core_domain_objects":"Dashboard, Account, Recommendation","acceptance_criteria":"1. The dashboard should display personalized information. 2. The information should be retrieved in real-time.","test_cases":"Given a customer with a specific profile, When they access the dashboard, Then they should see their account summary and relevant offers."},{"epic_title":"Account Opening and Service Modification Workflows","epic_key":"EPIC-4","number":1,"title":"Enable Digital Account Opening","description":"As a customer, I want to open a new account digitally, so that I can complete the process online without visiting a branch.","priority_business_value":"High","attributes_and_rules":"The workflow should guide users step-by-step, with pre-filled data and real-time validations.","core_domain_objects":"Account, Workflow","acceptance_criteria":"1. The user should be able to open a new account online. 2. Data should be pre-filled where possible.","test_cases":"Given a user initiating account opening, When they follow the workflow, Then they should be able to complete the process without manual intervention."},{"epic_title":"Application Draft Saving and Document Uploads","epic_key":"EPIC-5","number":1,"title":"Implement Draft Saving for Applications","description":"As a customer, I want to save an incomplete application, so that I can return later to complete it without losing progress.","priority_business_value":"Medium","attributes_and_rules":"The system should allow users to save their progress and resume at any time.","core_domain_objects":"Application, Draft","acceptance_criteria":"1. Users should be able to save incomplete applications. 2. Progress should be preserved when they return.","test_cases":"Given a user working on an application, When they choose to save their progress, Then they should be able to resume the application later from where they left off."},{"epic_title":"Request Tracking and Notification System","epic_key":"EPIC-6","number":1,"title":"Provide Real-Time Request Tracking","description":"As a customer, I want to track my request status, so that I know the progress of my applications.","priority_business_value":"High","attributes_and_rules":"The system should display real-time status updates and allow users to opt into notifications.","core_domain_objects":"Request, Tracking, Notification","acceptance_criteria":"1. Users should see the status of their requests. 2. Notifications should be sent at key stages.","test_cases":"Given a user submitting a request, When they check the portal, Then they should see the current status and receive notifications."},{"epic_title":"Core Banking Integration Layer","epic_key":"EPIC-7","number":1,"title":"Integrate with Core Banking System","description":"As a system, I want to integrate with the core banking platform, so that customer and account data are synchronized.","priority_business_value":"High","attributes_and_rules":"The integration layer should use APIs for real-time data exchange and include error handling.","core_domain_objects":"Integration, API, Data","acceptance_criteria":"1. Data should be synchronized between systems. 2. The integration should handle errors gracefully.","test_cases":"Given the portal and core banking system, When data is exchanged, Then it should be synchronized in real-time and errors should be managed."},{"epic_title":"Portal Database and Performance Optimization","epic_key":"EPIC-8","number":1,"title":"Optimize Portal Database Performance","description":"As a system administrator, I want an optimized database, so that portal performance remains high even under load.","priority_business_value":"Medium","attributes_and_rules":"The database should include indexing, caching, and load-balancing mechanisms.","core_domain_objects":"Database, Performance","acceptance_criteria":"1. The database should handle high concurrency. 2. Performance should remain stable under load.","test_cases":"Given a high number of user requests, When accessing the portal, Then the database should perform efficiently without degradation."},{"epic_title":"Comprehensive Audit Trail and Interaction History","epic_key":"EPIC-9","number":1,"title":"Record Detailed Audit Trails","description":"As a compliance officer, I want a detailed audit trail, so that customer actions and system interactions are logged for review and compliance.","priority_business_value":"High","attributes_and_rules":"The audit trail should capture logins, submissions, and other critical actions with timestamps.","core_domain_objects":"Audit, Log, Compliance","acceptance_criteria":"1. All actions should be logged with timestamps. 2. Immutable logs should be stored securely.","test_cases":"Given customer actions on the portal, When they perform critical operations, Then an audit log should record the details with timestamps."}]