[{"epic_title":"Multi-Factor Authentication and Secure Login","epic_key":"EPIC-1","number":1,"title":"Support multi-factor authentication options","description":"As a customer, I want multi-factor authentication options, so that I can secure my account with a second layer of security.","priority_business_value":"High","attributes_and_rules":"Support OTP via SMS, email, or authenticator apps.","core_domain_objects":"OTP, SMS, Email, Authenticator App","acceptance_criteria":"MFA should work with OTP sent via SMS, Email, or authenticator apps.","test_cases":"Given a customer, when they enable MFA, then they should receive OTP via the selected method."},{"epic_title":"Multi-Factor Authentication and Secure Login","epic_key":"EPIC-1","number":2,"title":"Establish password policies","description":"As a system administrator, I want to establish password policies, so that user accounts are protected against weak passwords.","priority_business_value":"Medium","attributes_and_rules":"Password policies must include complexity requirements.","core_domain_objects":"Password, Policy","acceptance_criteria":"Passwords must include at least 8 characters, a number, an uppercase letter, and a special character.","test_cases":"Given a user, when they create a password, then it should meet the stated complexity requirements."},{"epic_title":"Multi-Factor Authentication and Secure Login","epic_key":"EPIC-1","number":3,"title":"Implement session management","description":"As a customer, I want secure session management, so that my sessions remain protected.","priority_business_value":"High","attributes_and_rules":"Sessions should automatically expire after a set time period.","core_domain_objects":"Session","acceptance_criteria":"Sessions should expire after 30 minutes of inactivity.","test_cases":"Given an inactive session, when 30 minutes have passed, then the session should be automatically terminated."},{"epic_title":"Multi-Factor Authentication and Secure Login","epic_key":"EPIC-1","number":4,"title":"Account lockout feature","description":"As a security officer, I want account lockout features, so that repeated failed login attempts are mitigated.","priority_business_value":"High","attributes_and_rules":"Accounts should lock after 5 failed login attempts within 15 minutes.","core_domain_objects":"Account, Lockout","acceptance_criteria":"Accounts should lock after 5 consecutive failed login attempts.","test_cases":"Given multiple failed login attempts, when the threshold is reached, then the account should be locked."},{"epic_title":"Multi-Factor Authentication and Secure Login","epic_key":"EPIC-1","number":5,"title":"Integrate with identity management services","description":"As a system integrator, I want to integrate the authentication system with identity management services, so that it aligns with our existing infrastructure.","priority_business_value":"Medium","attributes_and_rules":"The authentication system must seamlessly integrate with existing identity management services.","core_domain_objects":"Identity Management Service","acceptance_criteria":"The system should authenticate users through the integrated identity management service.","test_cases":"Given a user, when they log in, then the system should authenticate using the integrated identity management service."},{"epic_title":"Personalized Customer Dashboard","epic_key":"EPIC-2","number":1,"title":"Display customer-specific account summaries","description":"As a customer, I want to see a summary of my accounts and balances, so that I can quickly understand my financial status.","priority_business_value":"High","attributes_and_rules":"Show account summaries and balances on the dashboard.","core_domain_objects":"Account, Balance","acceptance_criteria":"The dashboard should display account summaries and balances specific to the customer.","test_cases":"Given a logged-in customer, when they access the dashboard, then they should see their account summaries and balances."},{"epic_title":"Personalized Customer Dashboard","epic_key":"EPIC-2","number":2,"title":"Recommend products and services","description":"As a customer, I want personalized product and service recommendations, so that I can find relevant banking options.","priority_business_value":"Medium","attributes_and_rules":"Recommendations should be based on customer behavior, preferences, and eligibility data.","core_domain_objects":"Recommendation","acceptance_criteria":"The dashboard should intelligently recommend products/services based on the customer profile.","test_cases":"Given a customer's profile, when they visit the dashboard, then personalized recommendations should be displayed."},{"epic_title":"Personalized Customer Dashboard","epic_key":"EPIC-2","number":3,"title":"Provide quick actions for essential functions","description":"As a customer, I want quick access to functions like viewing transactions, submitting requests, and reviewing notifications, so that I can easily manage my banking activities.","priority_business_value":"High","attributes_and_rules":"Include quick links to view transaction history, submit requests, and review notifications.","core_domain_objects":"Transaction, Request, Notification","acceptance_criteria":"The dashboard should have quick action links for essential functions.","test_cases":"Given a customer, when they access the dashboard, then they should find quick links to essential functions."},{"epic_title":"Responsive and Accessible User Interface","epic_key":"EPIC-3","number":1,"title":"Develop a responsive front-end","description":"As a user, I want a responsive front-end, so that I can access the portal on any device without usability issues.","priority_business_value":"High","attributes_and_rules":"The front-end should be adaptive and accessible across desktop, tablet, and mobile devices.","core_domain_objects":"Responsive Front-End","acceptance_criteria":"The front-end must be usable on desktop, tablet, and mobile devices.","test_cases":"Given any device, when accessing the portal, then the front-end should be responsive and functional."},{"epic_title":"Responsive and Accessible User Interface","epic_key":"EPIC-3","number":2,"title":"Ensure compliance with WCAG 2.1","description":"As an accessibility advocate, I want the portal to comply with WCAG 2.1, so that it is accessible to users with disabilities.","priority_business_value":"High","attributes_and_rules":"Ensure all elements meet WCAG 2.1 accessibility standards.","core_domain_objects":"Accessibility","acceptance_criteria":"The portal must be compliant with WCAG 2.1.","test_cases":"Given users with disabilities, when accessing the portal, then they should find it meets WCAG 2.1 standards."},{"epic_title":"Account Opening and Service Modification Workflows","epic_key":"EPIC-4","number":1,"title":"Implement guided workflows for account openings","description":"As a customer, I want guided workflows for account openings, so that I can easily open new accounts online.","priority_business_value":"High","attributes_and_rules":"Workflows should guide through steps with form validation and real-time eligibility checks.","core_domain_objects":"Workflow, Account Opening","acceptance_criteria":"The workflows should guide the user through all steps of account openings.","test_cases":"Given a user, when they begin opening an account, then they should be guided step-by-step."},{"epic_title":"Account Opening and Service Modification Workflows","epic_key":"EPIC-4","number":2,"title":"Simplify service modification requests","description":"As a customer, I want simplified service modification requests, so that I can easily update my banking services.","priority_business_value":"Medium","attributes_and_rules":"Include minimal interactions and ensure compliance with KYC and AML.","core_domain_objects":"Service Modification","acceptance_criteria":"The workflows should simplify service modification requests.","test_cases":"Given a customer, when requesting service modifications, then the process should be simplified and compliant with regulations."},{"epic_title":"Document Upload and Application Save/Resume","epic_key":"EPIC-5","number":1,"title":"Implement secure document upload functionality","description":"As a customer, I want to securely upload documents, so that I can submit required documentation online.","priority_business_value":"High","attributes_and_rules":"Support image and PDF formats with antivirus scanning and encryption.","core_domain_objects":"Document Upload","acceptance_criteria":"The system should support secure uploading of documents in image and PDF formats.","test_cases":"Given a user, when uploading documents, then they should be scanned, encrypted, and securely uploaded."},{"epic_title":"Document Upload and Application Save/Resume","epic_key":"EPIC-5","number":2,"title":"Save and resume incomplete applications","description":"As a customer, I want to save incomplete applications, so that I can resume them later without losing data.","priority_business_value":"High","attributes_and_rules":"Allow saving intermediate data securely with version control.","core_domain_objects":"Application Save/Resume","acceptance_criteria":"Partially completed applications should be stored securely and resumable from any device.","test_cases":"Given an incomplete application, when saving, then it should be securely stored and later resumable."},{"epic_title":"Real-Time Status Tracking and Notifications","epic_key":"EPIC-6","number":1,"title":"Enable real-time status tracking for requests","description":"As a customer, I want to track the status of my requests in real time, so that I am aware of their progress.","priority_business_value":"High","attributes_and_rules":"The dashboard should show real-time status updates for customer requests.","core_domain_objects":"Status Tracking","acceptance_criteria":"Customers should be able to track request statuses in real-time.","test_cases":"Given a customer request, when it progresses, then the customer should see real-time updates in their dashboard."},{"epic_title":"Real-Time Status Tracking and Notifications","epic_key":"EPIC-6","number":2,"title":"Integrate automated email and SMS notifications","description":"As a customer, I want automated notifications via email and SMS, so that I receive timely updates about my request statuses.","priority_business_value":"Medium","attributes_and_rules":"Send notifications when actions are required, request stages advance, or upon completion.","core_domain_objects":"Notification","acceptance_criteria":"Email and SMS notifications should be sent for status updates.","test_cases":"Given a request status change, when it occurs, then the customer should receive an email or SMS notification."},{"epic_title":"Comprehensive Interaction and Activity History","epic_key":"EPIC-7","number":1,"title":"Record user interactions for audit","description":"As a security officer, I want to record user interactions, so that an auditable log of portal activities is maintained.","priority_business_value":"High","attributes_and_rules":"Capture logins, form submissions, document uploads, and request changes.","core_domain_objects":"Logging, Interaction","acceptance_criteria":"All user interactions should be recorded and maintained in an audit log.","test_cases":"Given a user interaction, when it occurs, then it should be captured in the audit log."},{"epic_title":"Core Banking Integration Layer","epic_key":"EPIC-8","number":1,"title":"Develop secure integration layer with the core banking system","description":"As a system integrator, I want a secure integration layer with the core banking system, so that real-time data synchronization is maintained.","priority_business_value":"High","attributes_and_rules":"Handle real-time data exchange securely.","core_domain_objects":"Integration Layer","acceptance_criteria":"The integration layer should securely exchange data in real time with the core banking system.","test_cases":"Given a transaction, when it occurs, then the integration layer should handle real-time data exchange securely."},{"epic_title":"Role-Based Access Control and Authorization","epic_key":"EPIC-9","number":1,"title":"Implement role-based access control","description":"As a system administrator, I want to implement role-based access control, so that users only access permitted features.","priority_business_value":"High","attributes_and_rules":"Assign feature visibility and permissions according to predefined roles.","core_domain_objects":"RBAC","acceptance_criteria":"The system should enforce role-based access controls consistently.","test_cases":"Given a user, when assigned a role, then accesses should be controlled based on their role."}]