[{"epic_title":"Secure Authentication and Access Control","epic_key":"EPIC-1","number":1,"title":"Implement Multi-Factor Authentication","description":"As a customer, I want to log in using multiple authentication factors so that my account remains secure.","priority_business_value":"High","attributes_and_rules":"Supports SMS, email, and app-based authentication. Ensures secure verification and session management.","core_domain_objects":"Customers, Authentication System","acceptance_criteria":"1. Users can enable multi-factor authentication during login. 2. The system requires a second authentication method after password entry. 3. Inactive sessions auto-expire after a set period.","test_cases":"Given a customer enables MFA, When they log in, Then the system should request a second authentication factor. Given an inactive session, When the timeout period is reached, Then the system should log the user out automatically."},{"epic_title":"Secure Authentication and Access Control","epic_key":"EPIC-1","number":2,"title":"Implement Role-Based Access Control","description":"As a system administrator, I want to assign and control access permissions based on roles so that users can only access authorized features.","priority_business_value":"High","attributes_and_rules":"Define roles for customers, administrators, and staff. Assign permissions based on role. Restrict access to unauthorized features.","core_domain_objects":"Administrators, Customers, Access Control System","acceptance_criteria":"1. Administrators can define and assign roles. 2. Users can access features based on their assigned role. 3. Unauthorized access attempts are logged and denied.","test_cases":"Given a defined role, When an administrator assigns the role to a user, Then the user should have access appropriate to their role. Given a user with a role, When they attempt to access authorized features, Then they should succeed. Given a user with a role, When they attempt to access unauthorized features, Then they should be denied access and the attempt logged."},{"epic_title":"Personalized Dashboard Creation","epic_key":"EPIC-2","number":1,"title":"Display Account Overview and Balances","description":"As a customer, I want to see all my accounts and their balances in one place so that I can review my financial status easily.","priority_business_value":"High","attributes_and_rules":"Display a summary of accounts, balances, and recent transactions. Update data in real-time.","core_domain_objects":"Accounts, Customer Dashboard","acceptance_criteria":"1. The dashboard displays all the customer’s accounts. 2. Balances and recent transactions are accurately shown. 3. Data refreshes in real-time or on user request.","test_cases":"Given a customer, When they log into their dashboard, Then they should see all their accounts and balances. Given updated account information, When the customer refreshes the dashboard, Then the latest data should be displayed."},{"epic_title":"Personalized Dashboard Creation","epic_key":"EPIC-2","number":2,"title":"Provide Personalized Product and Offer Recommendations","description":"As a customer, I want personalized product recommendations based on my eligibility so I can explore relevant products easily.","priority_business_value":"Medium","attributes_and_rules":"Analyze customer profile and transaction history. Recommend products and offers based on eligibility criteria.","core_domain_objects":"Customer Profile, Product Recommendations","acceptance_criteria":"1. The system generates recommendations relevant to the customer. 2. Recommendations are updated based on recent activity. 3. Customers can explore and accept recommendations from the dashboard.","test_cases":"Given a set of eligibility criteria, When a customer logs in, Then the dashboard should display personalized product recommendations. Given a new transaction or profile update, When the system processes the data, Then recommendations should be adjusted accordingly."},{"epic_title":"Responsive User Interface","epic_key":"EPIC-3","number":1,"title":"Implement Responsive Layout Design","description":"As a customer, I want the banking portal to adjust dynamically across devices so that I can use it seamlessly anywhere.","priority_business_value":"High","attributes_and_rules":"Use responsive design principles. Ensure a fluid grid layout. Adapt to different screen sizes and orientations.","core_domain_objects":"User Interface, Design System","acceptance_criteria":"1. The portal layout adjusts automatically for desktop, tablet, and mobile devices. 2. Navigation and content remain accessible across all devices. 3. Performance remains consistent across devices.","test_cases":"Given a mobile device, When the customer accesses the portal, Then the layout should be mobile-friendly. Given a tablet device, When the customer accesses the portal, Then the layout should adapt to the tablet. Given a desktop device, When the customer accesses the portal, Then the layout should provide an optimal experience."},{"epic_title":"Digital Account Opening and Service Request Management","epic_key":"EPIC-4","number":1,"title":"Create Digital Account Opening Workflow","description":"As a customer, I want to open new bank accounts online so that I can start services without visiting a branch.","priority_business_value":"High","attributes_and_rules":"Guide users through necessary steps. Validate information automatically. Provide progress tracking.","core_domain_objects":"Digital Workflows, Account Management","acceptance_criteria":"1. Customers can complete account opening workflows online. 2. The system validates information at each step. 3. Customers can track the progress of their request.","test_cases":"Given a customer, When they initiate an account opening workflow, Then they should be guided through all necessary steps. Given valid information, When the customer submits each step, Then the information should be accepted and validated. Given progress tracking, When the customer advances through the workflow, Then they should see their current status."},{"epic_title":"Digital Account Opening and Service Request Management","epic_key":"EPIC-4","number":2,"title":"Provide Service Modification Workflow","description":"As a customer, I want to request changes to my existing services online so that I can manage updates easily.","priority_business_value":"High","attributes_and_rules":"Enable modifications for existing services. Validate requests for compliance. Provide confirmation and tracking.","core_domain_objects":"Service Requests, Modification Management","acceptance_criteria":"1. Customers can request modifications to their services online. 2. Requests are validated and processed securely. 3. Customers receive confirmation and can track the progress.","test_cases":"Given an existing service, When the customer initiates a modification request, Then the system should guide and validate their inputs. Given a modification request, When the system processes the request, Then it should provide confirmation and tracking details."},{"epic_title":"Application Draft and Document Management","epic_key":"EPIC-5","number":1,"title":"Develop Secure Document Upload Functionality","description":"As a customer, I want to upload supporting documents for my applications so that I can complete the process online.","priority_business_value":"Medium","attributes_and_rules":"Support multiple file formats. Securely store uploaded documents. Ensure compliance with data security standards.","core_domain_objects":"Document Management, Application Process","acceptance_criteria":"1. Customers can upload documents during their application process. 2. Uploaded documents are stored securely. 3. The system verifies and acknowledges successful uploads.","test_cases":"Given various file formats, When the customer uploads a document, Then the system should accept and store the file securely. Given an upload, When the document is successfully saved, Then the customer should receive acknowledgment."}]