[{"epic_title":"Secure Multi-Factor Authentication (MFA)","epic_key":"EPIC-1","number":1,"title":"Implement Multi-Factor Authentication mechanism","description":"As a customer, I want to use a secure login process with multiple verification factors, so that my account remains protected.","priority_business_value":"High","attributes_and_rules":"Combine password, OTP, and biometric verification; Implement session timeout; Device recognition; Encrypted storage of authentication tokens; Adhere to PCI-DSS compliance standards.","core_domain_objects":"Authentication tokens, User sessions, Device data","acceptance_criteria":"1. Users can log in with a combination of password, OTP, and biometric verification. 2. Session times out after a period of inactivity. 3. Devices are recognized upon subsequent logins. 4. Authentication tokens are stored securely and encrypted.","test_cases":"Given a user, when they log in using correct credentials and the provided OTP, then they should be successfully authenticated.\nGiven a user, when their session times out due to inactivity, then they should be required to log in again.\nGiven a previously authenticated device, when a user logs in again, then the device should be recognized.\nGiven all authentication data, when it is stored, then it should be encrypted."},{"epic_title":"Personalized Banking Dashboard","epic_key":"EPIC-2","number":1,"title":"Develop a dynamic personalized banking dashboard","description":"As a customer, I want a personalized dashboard displaying my financial products and services, so that I can easily access relevant information and offers.","priority_business_value":"High","attributes_and_rules":"Present account information, personalized offers, and product recommendations; Provide quick access to account balances, transactions, and shortcuts; Ensure real-time updates with a visually appealing layout.","core_domain_objects":"User profiles, Account data, Offers, Recommendations","acceptance_criteria":"1. Users can see their account details and personalized offers on the dashboard. 2. Real-time updates are reflected in account balances and transactions. 3. Shortcuts to manage services are accessible.","test_cases":"Given a user, when they access the dashboard, then they should see their account balance and transactions.\nGiven user profile data, when offers are personalized, then only relevant offers should be shown.\nGiven updated account information, when user refreshes the dashboard, then the information should be up to date."},{"epic_title":"Responsive and Accessible User Interface","epic_key":"EPIC-3","number":1,"title":"Design a responsive web interface","description":"As a customer, I want the portal to perform optimally across all my devices, so that I can have a consistent and accessible experience.","priority_business_value":"Medium","attributes_and_rules":"Adjust to different screen sizes and devices; Implement accessibility features compliant with WCAG standards; Maintain consistent navigation, load speed, and interactivity.","core_domain_objects":"User interface components, Accessibility settings","acceptance_criteria":"1. The interface adjusts to desktop, tablet, and mobile screens. 2. Accessibility features are in place meeting WCAG standards. 3. Navigation and interaction are consistent across all devices.","test_cases":"Given a desktop, tablet, or mobile device, when a user accesses the portal, then the layout should adjust accordingly.\nGiven WCAG standards, when accessibility features are tested, then they should meet compliance requirements.\nGiven various browsers and OS, when the portal is accessed, then it should perform consistently."},{"epic_title":"Digital Account Opening and Service Modification Workflows","epic_key":"EPIC-4","number":1,"title":"Build guided workflows for account opening and service modifications","description":"As a customer, I want guided workflows for opening accounts or modifying services, so that I can complete these processes quickly and efficiently.","priority_business_value":"High","attributes_and_rules":"Guided steps with minimal manual input; Automated eligibility checks and digital KYC verification; Real-time process tracking and backend system connectivity.","core_domain_objects":"Account data, Service modifications, KYC information, Workflow steps","acceptance_criteria":"1. Users can follow guided steps to open new accounts or modify existing services. 2. Eligibility and KYC checks are automated. 3. Real-time tracking of workflow progress is available.","test_cases":"Given a customer, when they initiate a new account or modify services, then they should be guided through the process.\nGiven user data, when eligibility and KYC checks are performed, then they should happen automatically.\nGiven an ongoing workflow, when progress is tracked, then its status should be updated in real time."},{"epic_title":"Save and Resume Functionality","epic_key":"EPIC-5","number":1,"title":"Introduce save-and-resume feature","description":"As a customer, I want to save my application progress and resume later, so that I can complete it at my convenience without data loss.","priority_business_value":"Medium","attributes_and_rules":"Securely save progress; Use encrypted storage and session tracking; Progress indicators and automated reminders.","core_domain_objects":"Application data, User sessions, Progress status","acceptance_criteria":"1. Users can securely save their progress on applications. 2. Progress is stored encrypted and tracked. 3. Users receive reminders for incomplete applications.","test_cases":"Given an incomplete application, when a user saves progress, then their data should be securely stored.\nGiven stored progress, when a user resumes the application, then their previous progress should be loaded.\nGiven an incomplete application, when reminders are set, then users should receive notifications."},{"epic_title":"Secure Document Upload and Verification","epic_key":"EPIC-6","number":1,"title":"Implement secure document upload functionality","description":"As a customer, I want to upload and verify documents securely through the portal, so that my applications can be processed without delays.","priority_business_value":"High","attributes_and_rules":"Support multiple file types; Encrypted upload and backend verification; Real-time updates for document approval/rejection.","core_domain_objects":"Uploaded documents, Verification status","acceptance_criteria":"1. Users can upload documents of various file types securely. 2. Uploaded documents are encrypted. 3. Backend systems verify documents and provide real-time status updates.","test_cases":"Given different file types, when a document is uploaded, then it should be supported and encrypted.\nGiven uploaded documents, when they are verified by backend systems, then the status should be updated in real time.\nGiven secure upload, when a document is processed, then it should be encrypted."},{"epic_title":"Real-Time Request Tracking and Notifications","epic_key":"EPIC-7","number":1,"title":"Develop real-time request tracking and notification system","description":"As a customer, I want real-time status updates and notifications for my submitted requests, so that I am always informed of my application's progress.","priority_business_value":"Medium","attributes_and_rules":"Live status tracking; Integrate notification services (email, SMS, in-portal alerts); Synchronization with backend systems.","core_domain_objects":"Request status, Notifications","acceptance_criteria":"1. Users can see live status updates of their requests. 2. Notifications are sent through various channels. 3. Backend systems are synchronized to provide accurate information.","test_cases":"Given a submitted request, when its status is updated, then users should see the live updates.\nGiven notification services, when an event occurs, then users should receive email or SMS alerts.\nGiven backend synchronization, when a request status changes, then the update should be reflected accurately."},{"epic_title":"Comprehensive Interaction History and Activity Log","epic_key":"EPIC-8","number":1,"title":"Implement comprehensive interaction history and activity log","description":"As a customer, I want to track my interaction history with the portal, so that I have a complete record of all activities and status changes.","priority_business_value":"Medium","attributes_and_rules":"Capture user events (login, document uploads, service requests); Include timestamps and status changes; Provide summarized view for customers and detailed reports for administrators.","core_domain_objects":"Interaction logs, Event status","acceptance_criteria":"1. User events and interactions are captured with timestamps. 2. Users can see a summarized view of their interaction history. 3. Administrators can generate detailed reports for compliance.","test_cases":"Given user events, when interactions are logged, then timestamps and status changes should be recorded.\nGiven interaction history, when a user views it, then they should see a summarized view.\nGiven logged activities, when reports are generated, then administrators should see detailed history."},{"epic_title":"Core Banking System Integration Layer","epic_key":"EPIC-9","number":1,"title":"Develop API-based integration with core banking system","description":"As a customer, I want seamless integration with the bank's core system, so that I can get real-time processing for my requests.","priority_business_value":"High","attributes_and_rules":"Two-way data exchange for inquiries and updates; Asynchronous synchronization; Error management and retry mechanisms.","core_domain_objects":"API endpoints, Data synchronization, Error logs","acceptance_criteria":"1. The portal supports two-way data exchange with the core banking system. 2. Real-time data synchronization is in place. 3. Error management and retry mechanisms minimize downtime.","test_cases":"Given an API endpoint, when a transaction inquiry is made, then the data should be updated in real-time.\nGiven synchronization tools, when data changes, then it should sync asynchronously.\nGiven error management, when an error occurs, then retry mechanisms should handle it."},{"epic_title":"Role-Based Access Control (RBAC)","epic_key":"EPIC-10","number":1,"title":"Implement role-based access control","description":"As an administrator, I want role-based access management, so that user access is controlled based on profiles and authorization levels.","priority_business_value":"Medium","attributes_and_rules":"Define permissions for user roles; Centralized audit visibility; Privilege escalation requests; Session monitoring.","core_domain_objects":"User roles, Access permissions, Session logs","acceptance_criteria":"1. User roles are defined with specific permissions. 2. Access actions are recorded for audit. 3. Privilege escalation and session monitoring are supported.","test_cases":"Given user roles, when access permissions are set, then they should match role requirements.\nGiven audit logs, when access actions occur, then they should be recorded.\nGiven access requests, when privilege escalation is needed, then it should be handled."},{"epic_title":"Dedicated Portal Database and Performance Optimization","epic_key":"EPIC-11","number":1,"title":"Maintain high-performance database for self-service portal","description":"As a customer, I want the portal data to be stored in a high-performance database, so that my interactions are processed efficiently during peak times.","priority_business_value":"High","attributes_and_rules":"Secure and optimized database architecture; Caching, indexing, and performance tuning; Data encryption, automated backups, and failover mechanisms.","core_domain_objects":"Database schema, Encryption keys, Backup schedules","acceptance_criteria":"1. Database is optimized for high performance. 2. Data encryption and automated backups are in place. 3. Failover mechanisms ensure continuous availability.","test_cases":"Given peak loads, when database operations are performed, then they should be efficient.\nGiven sensitive data, when stored, then it should be encrypted.\nGiven system failures, when failover mechanisms are tested, then they should ensure availability."}]