[{"epic_title":"Secure Multi-Factor Authentication (MFA)","epic_key":"EPIC-1","number":1,"title":"Implement secure login with multi-factor authentication","description":"As a customer, I want a secure login mechanism using multi-factor authentication, so that my access to the service is protected.","priority_business_value":"High","attributes_and_rules":"The system must use a combination of credentials (e.g., passwords, OTPs, biometrics) that comply with PCI DSS and GDPR standards.","core_domain_objects":"Login, Multi-Factor Authentication, Credentials","acceptance_criteria":"The system should validate the user's credentials using two or more factors.","test_cases":"Given a user, when they enter their password and OTP, then they should be granted access if both are correct."},{"epic_title":"Secure Multi-Factor Authentication (MFA)","epic_key":"EPIC-1","number":2,"title":"Include secure password recovery and timeout management","description":"As a customer, I want secure password recovery options and session timeout management, so that I can recover access without compromising security.","priority_business_value":"Medium","attributes_and_rules":"Provide secure methods for recovering passwords and manage session timeouts to enhance security.","core_domain_objects":"Password Recovery, Session Management","acceptance_criteria":"The system should allow users to securely recover their password and automatically timeout inactive sessions.","test_cases":"Given an inactive session, when the timeout is reached, then the session should be terminated."},{"epic_title":"Personalized Dashboard Experience","epic_key":"EPIC-2","number":1,"title":"Develop a dynamic customer-specific dashboard","description":"As a customer, I want a personalized dashboard, so that I can see my relevant banking information and offerings.","priority_business_value":"High","attributes_and_rules":"The dashboard should dynamically update based on customer activities and interests.","core_domain_objects":"Dashboard, Banking Information, Customer Profile","acceptance_criteria":"The dashboard should display real-time updates of account summaries, transactions, and offers.","test_cases":"Given a customer with recent transactions, when they log in, then the dashboard should show their latest transactions."},{"epic_title":"Responsive and Accessible User Interface","epic_key":"EPIC-3","number":1,"title":"Develop a responsive interface for all devices","description":"As a customer, I want a responsive user interface, so that I can access the portal from any device.","priority_business_value":"Medium","attributes_and_rules":"The interface should comply with WCAG 2.1 AA standards and adapt to various devices.","core_domain_objects":"User Interface, Responsive Design","acceptance_criteria":"The UI should be accessible and consistent across desktop, tablet, and mobile devices.","test_cases":"Given a mobile device, when the portal is accessed, then the interface should display appropriately for mobile use."},{"epic_title":"Account Opening and Service Modification Workflows","epic_key":"EPIC-4","number":1,"title":"Create streamlined workflows for account opening","description":"As a customer, I want an intuitive workflow for opening new accounts, so that I can complete the process easily online.","priority_business_value":"High","attributes_and_rules":"The workflow should minimize manual inputs and ensure compliance with KYC and AML requirements.","core_domain_objects":"Account Opening, Workflow","acceptance_criteria":"The workflow should guide the user through the account opening process with pre-filled data and automatic validations.","test_cases":"Given a customer with existing records, when opening a new account, then the system should pre-fill relevant data."},{"epic_title":"Save and Resume Incomplete Applications","epic_key":"EPIC-5","number":1,"title":"Allow saving and resuming of incomplete applications","description":"As a customer, I want to save my progress in applications, so that I can resume later from any authenticated device.","priority_business_value":"Medium","attributes_and_rules":"The system should enable secure session recovery and protect saved information.","core_domain_objects":"Application, Session Recovery","acceptance_criteria":"Users should be able to save and resume their application progress securely from any device.","test_cases":"Given an incomplete application, when the user saves and resumes later, then the application should continue from the last saved checkpoint."},{"epic_title":"Secure Document Upload and Validation","epic_key":"EPIC-6","number":1,"title":"Implement secure document upload functionality","description":"As a customer, I want to upload required documents securely, so that my application can be processed without risks.","priority_business_value":"High","attributes_and_rules":"Documents must be encrypted during upload and at rest. Include file type validation and malware scanning.","core_domain_objects":"Document Upload, Validation, Encryption","acceptance_criteria":"The system should securely upload and validate documents, providing rejection handling and notifications.","test_cases":"Given a document to upload, when the upload is complete, then the document should be securely stored and validated."},{"epic_title":"Real-Time Request Tracking and Notifications","epic_key":"EPIC-7","number":1,"title":"Enable real-time tracking of requests and notifications","description":"As a customer, I want to track my requests in real-time, so that I know the status and receive updates.","priority_business_value":"Medium","attributes_and_rules":"The system should provide full visibility into request statuses and send automated notifications via email or SMS.","core_domain_objects":"Request Tracking, Notification","acceptance_criteria":"Customers should be able to see their request status and receive timely notifications.","test_cases":"Given a submitted request, when there is an update, then the customer should receive a notification."},{"epic_title":"Comprehensive Interaction History and Audit Trail","epic_key":"EPIC-8","number":1,"title":"Maintain secure log of customer interactions","description":"As an administrator, I want to view interaction history, so that I can audit and generate compliance reports.","priority_business_value":"High","attributes_and_rules":"Logs must include detailed activity records and be immutable. Provide user access to personal interaction history.","core_domain_objects":"Interaction History, Audit Trail, Logs","acceptance_criteria":"The system should maintain a secure log of all interactions with access for audits and reports.","test_cases":"Given recorded interactions, when an audit is required, then the administrator should access detailed logs."},{"epic_title":"Core Banking System Integration","epic_key":"EPIC-9","number":1,"title":"Integrate self-service portal with core banking system","description":"As a developer, I want to ensure seamless data exchange between the portal and the core banking system, so that the data is always synchronized.","priority_business_value":"High","attributes_and_rules":"Use secure APIs for real-time bidirectional data flow and ensure high availability and reliability.","core_domain_objects":"Data Integration, Middleware, Core Banking","acceptance_criteria":"The portal and core banking system should stay synchronized in real-time.","test_cases":"Given changes in account data, when updated in the core system, then the portal should reflect those changes immediately."},{"epic_title":"Role-Based Access Control (RBAC)","epic_key":"EPIC-10","number":1,"title":"Implement role-based access control system","description":"As an administrator, I want to assign access levels based on user roles, so that data and services are securely restricted.","priority_business_value":"Medium","attributes_and_rules":"The system must align with the principles of least privilege and be configurable at function and data levels.","core_domain_objects":"RBAC, Access Control, Permissions","acceptance_criteria":"Users should have access only to the data and services appropriate for their role.","test_cases":"Given a user with a specific role, when accessing the portal, then they should see only permitted data and services for their role."},{"epic_title":"Dedicated Portal Database and System Optimization","epic_key":"EPIC-11","number":1,"title":"Design an optimized database for the portal","description":"As a system architect, I want a dedicated database for the portal, so that performance and reliability are ensured.","priority_business_value":"High","attributes_and_rules":"Include encryption, query optimization, caching, and load balancing for high availability.","core_domain_objects":"Database, Optimization, Performance","acceptance_criteria":"The database should handle portal transactions efficiently and support high availability.","test_cases":"Given a peak load condition, when queries are executed, then the database should respond efficiently without downtime."}]