[{"epic_title":"User Authentication and Multi-Factor Login","epic_key":"EPIC-1","number":1,"title":"Implement Multi-Factor Authentication for Secure Login","description":"As a user, I want to use multi-factor authentication, so that my account is secure.","priority_business_value":"High","attributes_and_rules":"Integrate OTP through SMS/email and potential app-based authenticators. Implement session management, password recovery features, and account lockout mechanisms.","core_domain_objects":"User, Session, OTP","acceptance_criteria":"1. User must be able to receive OTP via SMS/email. 2. User must be able to recover password. 3. User must be locked out after multiple failed attempts.","test_cases":"Given the user has entered their password, When they request OTP, Then they should receive it via SMS or email. Given the user has forgotten their password, When they request recovery, Then they should be able to reset their password. Given the user has failed multiple login attempts, When they exceed the limit, Then their account should be locked."},{"epic_title":"User Dashboard and Personalization","epic_key":"EPIC-2","number":1,"title":"Develop Personalized User Dashboard","description":"As a user, I want a personalized dashboard, so that I can see relevant banking products and account information.","priority_business_value":"Medium","attributes_and_rules":"Dashboard should utilize user profile data and eligibility criteria to show tailored services.","core_domain_objects":"User Profile, Account, Product","acceptance_criteria":"1. Dashboard displays user-specific account balances. 2. Dashboard shows relevant products based on user profile.","test_cases":"Given the user logs in, When the dashboard loads, Then it should display their specific account balances. Given the user is eligible for certain products, When they access the dashboard, Then it should display products relevant to their profile."},{"epic_title":"Responsive UI/UX Design","epic_key":"EPIC-3","number":1,"title":"Ensure Responsive Design Across Devices","description":"As a user, I want the portal to be usable across my devices, so that I can have a seamless experience.","priority_business_value":"Medium","attributes_and_rules":"UI components should adjust to screen sizes without loss of functionality. Ensure design meets WCAG standards.","core_domain_objects":"UI Component","acceptance_criteria":"1. Portal layout adjusts to desktop, tablet, and mobile. 2. Portal complies with WCAG standards.","test_cases":"Given the user accesses the portal on a desktop, When they resize the window, Then UI components should adjust accordingly. Given the portal is accessed on different devices, When features are used, Then functionality should remain consistent."},{"epic_title":"Account Opening and Service Modification Workflows","epic_key":"EPIC-4","number":1,"title":"Streamline Account Opening and Service Modifications","description":"As a user, I want to open accounts and modify services easily, so that I can manage my banking needs efficiently.","priority_business_value":"High","attributes_and_rules":"Minimize clicks and steps required. Maintain compliance with KYC and regulatory requirements. Include automated routing and approval mechanisms.","core_domain_objects":"Account, Service Request","acceptance_criteria":"1. Users can initiate account opening requests with minimal steps. 2. Service modifications follow regulatory compliance.","test_cases":"Given the user wants to open a new account, When they initiate the request, Then the process should be completed in minimal steps. Given the user wants to modify a service, When they follow the workflow, Then the request should comply with KYC and regulatory requirements."},{"epic_title":"Document Upload and Application Save/Resume Feature","epic_key":"EPIC-5","number":1,"title":"Implement Document Upload and Save/Resume Application Feature","description":"As a user, I want to upload documents and save my application progress, so that I can complete processes at my convenience.","priority_business_value":"High","attributes_and_rules":"Enable file encryption, format validation, secure storage. Allow applications to be saved and resumed from any device.","core_domain_objects":"Document, Application","acceptance_criteria":"1. Users can upload documents securely. 2. Users can save and resume applications.","test_cases":"Given the user needs to upload a document, When they upload, Then the file should be encrypted and validated. Given the user starts an application, When they save progress, Then they should be able to resume from any device."},{"epic_title":"Real-Time Request Tracking and Notifications","epic_key":"EPIC-6","number":1,"title":"Develop Real-Time Tracking and Notifications for Requests","description":"As a user, I want to track my requests in real-time and receive notifications, so that I am informed of the status.","priority_business_value":"Medium","attributes_and_rules":"Integrate automated email and SMS notifications. Include a historical view of submitted requests.","core_domain_objects":"Request, Notification","acceptance_criteria":"1. Users can track requests in real-time. 2. Users receive notifications for status changes.","test_cases":"Given the user submits a request, When the status changes, Then they should receive an email/SMS notification. Given the user has submitted requests, When they check history, Then they should see all previous submissions."},{"epic_title":"Interaction History and Audit Logging","epic_key":"EPIC-7","number":1,"title":"Maintain Interaction History and Audit Logs","description":"As a system administrator, I want to have detailed interaction and audit logs, so that I can ensure compliance and review activities.","priority_business_value":"High","attributes_and_rules":"Logs should be tamper-proof and easily retrievable. Store logs securely in alignment with data retention policy.","core_domain_objects":"Interaction, Audit Log","acceptance_criteria":"1. All user interactions are logged. 2. Logs are securely stored and tamper-proof.","test_cases":"Given a user interaction occurs, When it is logged, Then the log should be tamper-proof and stored securely. Given an audit is needed, When logs are reviewed, Then they should be easily retrievable and complete."},{"epic_title":"Core Banking System Integration","epic_key":"EPIC-8","number":1,"title":"Integrate Portal with Core Banking System","description":"As a user, I want real-time data exchange between the portal and core banking system, so that I have up-to-date information.","priority_business_value":"High","attributes_and_rules":"Use APIs or middleware for integration. Ensure data synchronization and transactional consistency.","core_domain_objects":"Account Data, Product Offering","acceptance_criteria":"1. Data exchange between the portal and core system is real-time. 2. Information is consistent and up-to-date.","test_cases":"Given the user accesses their account, When data is retrieved, Then it should be up-to-date and accurate. Given an update occurs in the core system, When the portal retrieves data, Then it should reflect the latest changes."},{"epic_title":"Role-Based Access Control Implementation","epic_key":"EPIC-9","number":1,"title":"Configure and Enforce Role-Based Access Control","description":"As a system administrator, I want role-based access control, so that users have appropriate permissions.","priority_business_value":"High","attributes_and_rules":"Define roles and access privileges. Integrate RBAC with authentication system.","core_domain_objects":"Role, User, Permission","acceptance_criteria":"1. Users can view and perform actions based on their role. 2. RBAC is enforced across portal modules.","test_cases":"Given the user logs in, When they access the portal, Then they should see functions relevant to their role. Given a role is defined, When the user is assigned, Then they should have correct access privileges."},{"epic_title":"Dedicated Portal Database and Performance Optimization","epic_key":"EPIC-10","number":1,"title":"Develop and Optimize Dedicated Portal Database","description":"As a system administrator, I want a dedicated database for the portal, so that performance and reliability are enhanced.","priority_business_value":"Medium","attributes_and_rules":"Implement indexing, caching, and query optimization. Ensure regular backups, encryption, and redundancy.","core_domain_objects":"Database, Index, Cache","acceptance_criteria":"1. Database performance is optimized. 2. Data integrity and resilience are ensured.","test_cases":"Given the portal uses a dedicated database, When queries are executed, Then response times should be optimized. Given data is stored, When backups are performed, Then the process should be secure and reliable."}]