{"session_id":"toggleon_sessionid","project_name":"Digital-Customer-Banking-Portal","jira_url":"https://brillio.atlassian.net/jira/software/c/projects/ADAM/boards/2056/backlog","repo_link":"https://github.com/Pardhu-Guttula/Digital-Customer-Banking-Portal","epics":[{"id":"EPIC-1","title":"User Authentication","summary":"Implement user signup and login functionality.","description":"Develop the user authentication system using Next.js for the frontend and Node.js for the backend. The system should support user registration, login, and password recovery features. User data should be securely stored in PostgreSQL.","dependencies":[],"jira_epic_key":"ADAM-1228"},{"id":"EPIC-2","title":"Product Listings","summary":"Create and manage product listings.","description":"Develop the product listing pages and backend endpoints to support adding, viewing, and editing product details. The product data should be stored and managed in PostgreSQL.","dependencies":[],"jira_epic_key":"ADAM-1222"},{"id":"EPIC-3","title":"Shopping Cart","summary":"Implement shopping cart functionality.","description":"Develop a shopping cart system where users can add products, update quantities, and remove items. The cart state should be managed on the frontend using Next.js and the backend using Node.js, with data persisted in PostgreSQL.","dependencies":[],"jira_epic_key":"ADAM-1225"},{"id":"EPIC-4","title":"Checkout Process","summary":"Build the checkout process for users to purchase products.","description":"Implement the checkout process including address entry, payment processing, and order confirmation using Next.js on the frontend and Node.js on the backend. Relevant order and payment information should be stored in PostgreSQL.","dependencies":["EPIC-3"],"jira_epic_key":"ADAM-1224"},{"id":"EPIC-5","title":"Order Management","summary":"Manage and track user orders.","description":"Develop the order management system that tracks user orders, order status, and allows users to view their order history. Utilize Next.js for the frontend, Node.js for the backend, and PostgreSQL for data storage.","dependencies":["EPIC-4"],"jira_epic_key":"ADAM-1223"},{"id":"EPIC-6","title":"Admin Dashboard","summary":"Create an admin dashboard for managing the ecommerce system.","description":"Develop an admin dashboard to manage products, orders, and user accounts using Next.js for the frontend and Node.js for the backend. Data should be managed through PostgreSQL.","dependencies":["EPIC-2","EPIC-5"],"jira_epic_key":"ADAM-1227"},{"id":"EPIC-7","title":"Product Recommendations","summary":"Implement product recommendations based on user preferences.","description":"Develop a recommendation engine to suggest products to users based on their browsing and purchase history. Use Next.js for the frontend, Node.js for backend computations, and PostgreSQL to store user activity data.","dependencies":["EPIC-5"],"jira_epic_key":"ADAM-1229"},{"id":"EPIC-8","title":"User Reviews and Ratings","summary":"Enable users to leave reviews and ratings for products.","description":"Implement a system for users to submit reviews and ratings for products. This will involve developing both frontend components in Next.js and backend endpoints in Node.js, with data stored in PostgreSQL.","dependencies":["EPIC-2"],"jira_epic_key":"ADAM-1226"},{"id":"EPIC-9","title":"Analytics and Reporting","summary":"Create analytics and reporting features to gain insights into sales and user behavior.","description":"Develop features to track and analyze sales data, user behavior, and other key metrics. Use Next.js for data visualization on the frontend, Node.js for backend data aggregation, and PostgreSQL for data storage and retrieval.","dependencies":["EPIC-6"],"jira_epic_key":"ADAM-1230"}],"error":"Your request is invalid or could not be processed by the service"}